[
{"Title": "Microsoft", "Organization_name": "Microsoft Corporation", "Type": "Public", "Traded as": "NASDAQ: MSFT, NASDAQ-100 component, DJIA component, S&P 100 component, S&P 500 component", "ISIN": "US5949181045", "Industry": "Software development, Computer hardware, Consumer electronics, Social networking service, Cloud computing, Video games, Internet, Corporate venture capital", "Founded": "April 4, 1975 ; 44 years ago (1975-04-04) in Albuquerque, New Mexico, U.S.", "Founders": "Bill Gates, Paul Allen", "Headquarters": "One Microsoft Way, Redmond, Washington, U.S.", "Area served": "Worldwide", "Key people": "Satya Nadella, (CEO), Chris Capossela, (CMO and EVP), Amy Hood, (CFO and EVP), Kurt DelBene, (CDO and EVP), Kevin Scott, (CTO and EVP), Brad Smith, (President), Jean-Philippe Courtois, (President and EVP), John W. Thompson, (Chairman), Bill Gates, (Technical Advisor)", "Products": "Windows, Office, Servers, Skype, Visual Studio, Dynamics, Xbox, Surface, Mobile, List of software", "Services": "Azure, Bing, LinkedIn, Yammer, MSDN, Office 365, OneDrive, Outlook.com, GitHub, TechNet, Pay, Microsoft Store, Windows Update, Xbox Game Pass, Xbox Live", "Revenue": "US$ 125.8 billion (2019)", "Operating income": "US$43.0 billion (2019)", "Net income": "US$39.2 billion (2019)", "Total assets": "US$286.55 billion (2019)", "Total equity": "US$102.33 billion (2019)", "Owner": "BlackRock (0.03), Steve Ballmer (0.04), Bill Gates (0.04), The Vanguard Group (0.06), Capital Group Companies (0.05), State Street Corporation (0.04)", "Number of employees": "144,106 (2019)", "Website": "microsoft.com", "strings": ["Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports, and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. In 2016, it was the world's largest software maker by revenue (currently Alphabet/Google has more revenue).", "Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016,", "As of 2015[update], Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite market, although it has lost the majority of the overall operating system market to Android. The company also produces a wide range of other consumer and enterprise software for desktops, laptops, tabs, gadgets, and servers, including Internet search (with Bing), the digital services market (through MSN), mixed reality (HoloLens), cloud computing (Azure), and software development (Visual Studio).", "Steve Ballmer replaced Gates as CEO in 2000, and later envisioned a \"devices and services\" strategy.", "In 2018, Microsoft surpassed Apple Inc. as the most valuable publicly traded company in the world after having been dethroned by Apple in 2010.", "Childhood friends Bill Gates and Paul Allen sought to make a business utilizing their shared skills in computer programming.", "Microsoft entered the operating system (OS) business in 1980 with its own version of Unix, called Xenix.", "Despite having begun jointly developing a new operating system, OS/2, with IBM in August 1985,", "In 1990, Microsoft introduced its office suite, Microsoft Office. The suite bundled separate productivity applications, such as Microsoft Word and Microsoft Excel.", "On July 27, 1994, the U.S. Department of Justice, Antitrust Division filed a Competitive Impact Statement that said, in part: \"Beginning in 1988, and continuing until July 15, 1994, Microsoft induced many OEMs to execute anti-competitive \"per processor\" licenses. Under a per processor license, an OEM pays Microsoft a royalty for each computer it sells containing a particular microprocessor, whether the OEM sells the computer with a Microsoft operating system or a non-Microsoft operating system. In effect, the royalty payment to Microsoft when no Microsoft product is being used acts as a penalty, or tax, on the OEM's use of a competing PC operating system. Since 1988, Microsoft's use of per processor licenses has increased.\"", "Following Bill Gates' internal \"Internet Tidal Wave memo\" on May 26, 1995, Microsoft began to redefine its offerings and expand its product line into computer networking and the World Wide Web. :323–324", "On January 13, 2000, Bill Gates handed over the CEO position to Steve Ballmer, an old college friend of Gates and employee of the company since 1980, while creating a new position for himself as Chief Software Architect.", "Released in January 2007, the next version of Windows, Vista, focused on features, security and a redesigned user interface dubbed Aero.", "Gates retired from his role as Chief Software Architect on June 27, 2008, a decision announced in June 2006, while retaining other positions related to the company in addition to being an advisor for the company on key projects.", "As the smartphone industry boomed in 2007, Microsoft had struggled to keep up with its rivals Apple and Google in providing a modern smartphone operating system. As a result, in 2010 Microsoft revamped their aging flagship mobile operating system, Windows Mobile, replacing it with the new Windows Phone OS. Microsoft implemented a new strategy for the software industry that had them working more closely with smartphone manufacturers, such as Nokia, and providing a consistent user experience across all smartphones using the Windows Phone OS. It used a new user interface design language, codenamed \"Metro\", which prominently used simple shapes, typography and iconography, utilizing the concept of minimalism. Microsoft is a founding member of the Open Networking Foundation started on March 23, 2011. Fellow founders were Google, HP Networking, Yahoo!, Verizon Communications, Deutsche Telekom and 17 other companies. This nonprofit organization is focused on providing support for a new cloud computing initiative called Software-Defined Networking.", "Following the release of Windows Phone, Microsoft undertook a gradual rebranding of its product range throughout 2011 and 2012, with the corporation's logos, products, services and websites adopting the principles and concepts of the Metro design language.", "In July 2012, Microsoft sold its 50% stake in MSNBC, which it had run as a joint venture with NBC since 1996.", "In August 2012, the New York City Police Department announced a partnership with Microsoft for the development of the Domain Awareness System which is used for Police surveillance in New York City.", "The Kinect, a motion-sensing input device made by Microsoft and designed as a video game controller, first introduced in November 2010, was upgraded for the 2013 release of the Xbox One video game console. Kinect's capabilities were revealed in May 2013: an ultra-wide 1080p camera, function in the dark due to an infrared sensor, higher-end processing power and new software, the ability to distinguish between fine movements (such as a thumb movements), and determining a user's heart rate by looking at their face.", "In line with the maturing PC business, in July 2013, Microsoft announced that it would reorganize the business into four new business divisions, namely Operating System, Apps, Cloud, and Devices. All previous divisions will be dissolved into new divisions without any workforce cuts.", "On February 4, 2014, Steve Ballmer stepped down as CEO of Microsoft and was succeeded by Satya Nadella, who previously led Microsoft's Cloud and Enterprise division.", "On January 21, 2015, Microsoft announced the release of their first Interactive whiteboard, Microsoft Surface Hub.", "On March 1, 2016, Microsoft announced the merger of its PC and Xbox divisions, with Phil Spencer announcing that Universal Windows Platform (UWP) apps would be the focus for Microsoft's gaming in the future.", "In January 2018, Microsoft patched Windows 10 to account for CPU problems related to Intel's Meltdown security breach. The patch led to issues with the Microsoft Azure virtual machines reliant on Intel's CPU architecture. On January 12, Microsoft released PowerShell Core 6.0 for the macOS and Linux operating systems.", "In August 2018, Toyota Tsusho began a partnership with Microsoft to create fish farming tools using the Microsoft Azure application suite for Internet of things (IoT) technologies related to water management. Developed in part by researchers from Kindai University, the water pump mechanisms use artificial intelligence to count the number of fish on a conveyor belt, analyze the number of fish, and deduce the effectiveness of water flow from the data the fish provide. The specific computer programs used in the process fall under the Azure Machine Learning and the Azure IoT Hub platforms.", "February 20, 2019 Microsoft Corp said it will offer its cyber security service AccountGuard to 12 new markets in Europe including Germany, France and Spain, to close security gaps and protect customers in political space from hacking.", "The company is run by a board of directors made up of mostly company outsiders, as is customary for publicly traded companies. Members of the board of directors as of January 2018 are Bill Gates, Satya Nadella, Reid Hoffman, Hugh Johnston, Teri List-Stoll, Charles Noski, Helmut Panke, Sandi Peterson, Penny Pritzker, Charles Scharf, Arne Sorenson, John W. Stanton, John W. Thompson and Padmasree Warrior.", "When Microsoft went public and launched its Initial Public Offering (IPO) in 1986, the opening stock price was $21; after the trading day, the price closed at $27.75. As of July 2010, with the company's nine stock splits, any IPO shares would be multiplied by 288; if one were to buy the IPO today, given the splits and other factors, it would cost about 9 cents.", "Standard & Poor's and Moody's Investors Service have both given a AAA rating to Microsoft, whose assets were valued at $41 billion as compared to only $8.5 billion in unsecured debt. Consequently, in February 2011 Microsoft released a corporate bond amounting to $2.25 billion with relatively low borrowing rates compared to government bonds.", "On July 20, 2012, Microsoft posted its first quarterly loss ever, despite earning record revenues for the quarter and fiscal year, with a net loss of $492 million due to a writedown related to the advertising company aQuantive, which had been acquired for $6.2 billion back in 2007.", "In November 2018, the company won a $480 million military contract with the U.S. government to bring augmented reality (AR) headset technology into the weapon repertoires of American soldiers. The two-year contract may result in follow-on orders of more than 100,000 headsets, according to documentation describing the bidding process. One of the contract's tag lines for the augmented reality technology seems to be its ability to enable \"25 bloodless battles before the 1st battle\", suggesting that actual combat training is going to be an essential aspect of the augmented reality headset capabilities.", "In 2004, Microsoft commissioned research firms to do independent studies comparing the total cost of ownership (TCO) of Windows Server 2003 to Linux; the firms concluded that companies found Windows easier to administrate than Linux, thus those using Windows would administrate faster resulting in lower costs for their company (i.e. lower TCO).", "As part of the \"Get the Facts\" campaign, Microsoft highlighted the .NET Framework trading platform that it had developed in partnership with Accenture for the London Stock Exchange, claiming that it provided \"five nines\" reliability. After suffering extended downtime and unreliability", "In 2012, Microsoft hired a political pollster named Mark Penn, whom The New York Times called \"famous for bulldozing\" his political opponents", "Microsoft has paid US$63.2 billion for its top 10 acquisitions.[citation needed]", "In July 2014, Microsoft announced plans to lay off 18,000 employees. Microsoft employed 127,104 people as of June 5, 2014, making this about a 14 percent reduction of its workforce as the biggest Microsoft lay off ever. This included 12,500 professional and factory personnel. Previously, Microsoft had eliminated 5,800 jobs in 2009 in line with the Great Recession of 2008–2017.", "Microsoft provides information about reported bugs in their software to intelligence agencies of the United States government, prior to the public release of the fix. A Microsoft spokesperson has stated that the corporation runs several programs that facilitate the sharing of such information with the U.S. government. However, in June 2013, an official statement from Microsoft flatly denied their participation in the program: .mw-parser-output .templatequote{overflow:hidden;margin:1em 0;padding:0 40px}.mw-parser-output .templatequote .templatequotecite{line-height:1.5em;text-align:left;padding-left:1.6em;margin-top:0}", "During the first six months in 2013, Microsoft had received requests that affected between 15,000 and 15,999 accounts.", "In April 2016, the company sued the U.S. government, arguing that secrecy orders were preventing the company from disclosing warrants to customers in violation of the company's and customers' rights. Microsoft argued that it was unconstitutional for the government to indefinitely ban Microsoft from informing its users that the government was requesting their emails and other documents, and that the Fourth Amendment made it so people or businesses had the right to know if the government searches or seizes their property. On October 23, 2017, Microsoft said it would drop the lawsuit as a result of a policy change by the United States Department of Justice (DoJ). The DoJ had \"changed data request rules on alerting Internet users about agencies accessing their information.\"", "Technical reference for developers and articles for various Microsoft magazines such as Microsoft Systems Journal (MSJ) are available through the Microsoft Developer Network (MSDN). MSDN also offers subscriptions for companies and individuals, and the more expensive subscriptions usually offer access to pre-release beta versions of Microsoft software.", "Noted for its internal lexicon, the expression \"eating your own dog food\" is used to describe the policy of using pre-release and beta versions of products inside Microsoft in an effort to test them in \"real-world\" situations.", "Microsoft is an outspoken opponent of the cap on H-1B visas, which allow companies in the U.S. to employ certain foreign workers. Bill Gates claims the cap on H1B visas makes it difficult to hire employees for the company, stating \"I'd certainly get rid of the H1B cap\" in 2005.", "In August 2018, Microsoft implemented a policy for all companies providing subcontractors to require 12 weeks of paid parental leave to each employee. This expands on the former requirement from 2015 requiring 15 days of paid vacation and sick leave each year.", "In 2011, Greenpeace released a report rating the top ten big brands in cloud computing on their sources of electricity for their data centers. At the time, data centers consumed up to 2% of all global electricity and this amount was projected to increase. Phil Radford of Greenpeace said \"we are concerned that this new explosion in electricity use could lock us into old, polluting energy sources instead of the clean energy available today,\"", "Microsoft's main U.S. campus received a silver certification from the Leadership in Energy and Environmental Design (LEED) program in 2008, and it installed over 2,000 solar panels on top of its buildings at its Silicon Valley campus, generating approximately 15 percent of the total energy needed by the facilities in April 2005.", "The corporate headquarters, informally known as the Microsoft Redmond campus, is located at One Microsoft Way in Redmond, Washington. Microsoft initially moved onto the grounds of the campus on February 26, 1986, weeks before the company went public on March 13. The headquarters has since experienced multiple expansions since its establishment. It is estimated to encompass over 8 million ft2 (750,000 m2) of office space and 30,000–40,000 employees.", "On October 26, 2015, the company opened its retail location on Fifth Avenue in New York City. The location features a five-story glass storefront and is 22,270 square feet.", "Microsoft adopted the so-called \"Pac-Man Logo\", designed by Scott Baker, in 1987. Baker stated \"The new logo, in Helvetica italic typeface, has a slash between the o and s to emphasize the \"soft\" part of the name and convey motion and speed.\"", "On August 23, 2012, Microsoft unveiled a new corporate logo at the opening of its 23rd Microsoft store in Boston, indicating the company's shift of focus from the classic style to the tile-centric modern interface, which it uses/will use on the Windows Phone platform, Xbox 360, Windows 8 and the upcoming Office Suites.", "The company was the official jersey sponsor of Finland's national basketball team at EuroBasket 2015.", "Coordinates: 47°38′23′′N 122°7′42′′W﻿ / ﻿47.63972°N 122.12833°W﻿ / 47.63972; -122.12833"]}
]