[
{"Title": "Apple Inc.", "Organization_name": "Apple Inc.", "Formerly": "Apple Computer Company, (1976–1977), Apple Computer, Inc., (1977–2007)", "Type": "Public", "Traded as": "NASDAQ: AAPL, NASDAQ-100 component, DJIA component, S&P 100 component, S&P 500 component", "ISIN": "US0378331005", "Industry": "Computer hardware, Computer software, Consumer electronics, Cloud computing, Digital distribution, Fabless silicon design, Semiconductors, Financial technology, Artificial intelligence", "Founded": "April 1, 1976 ; 43 years ago (1976-04-01)", "Founders": "Steve Jobs, Steve Wozniak, Ronald Wayne", "Headquarters": "1 Apple Park Way, Cupertino, California, U.S.", "Number of locations": "500+ retail stores (2019)", "Area served": "Worldwide", "Key people": "Arthur D. Levinson (Chairman), Tim Cook (CEO), Jeff Williams (COO)", "Products": "Macintosh, iPod, iPhone, iPad, Apple Watch, Apple TV, HomePod, macOS, iOS, iPadOS, watchOS, tvOS, iLife, iWork, Final Cut Pro, Logic Pro, GarageBand, Shazam, Siri", "Services": "App Store, Apple Arcade, Apple Card, Apple MusicBeats 1, Apple News+, Apple PayCash, Apple StoreGenius Bar, Apple TV+, iBooks Store, iCloud, iMessage, iTunes Store, Mac App Store", "Revenue": "US$ 265.595 billion (2018)", "Operating income": "US$70.898 billion (2018)", "Net income": "US$59.531 billion (2018)", "Total assets": "US$365.725 billion (2018)", "Total equity": "US$107.147 billion (2018)", "Owner": "The Vanguard Group (0.0664), BlackRock (0.0634), The Government Pension Fund of Norway (0.097)", "Number of employees": "132,000 (2018)", "Subsidiaries": "Braeburn Capital, Beats Electronics, Claris, Apple Energy, LLC, Apple Sales International , Apple Services , Apple Worldwide Video , Anobit, Beddit", "Website": "www.apple.com", "strings": ["Coordinates: 37°20′06′′N 122°00′32′′W﻿ / ﻿37.3349°N 122.0090°W﻿ / 37.3349; -122.0090", "Apple Inc. is an American multinational technology company headquartered in Cupertino, California, that designs, develops, and sells consumer electronics, computer software, and online services. It is considered one of the Big Four tech companies along with Amazon, Google, and Facebook.", "The company's hardware products include the iPhone smartphone, the iPad tablet computer, the Mac personal computer, the iPod portable media player, the Apple Watch smartwatch, the Apple TV digital media player, the AirPods wireless earbuds and the HomePod smart speaker. Apple's software includes the macOS, iOS, iPadOS, watchOS, and tvOS operating systems, the iTunes media player, the Safari web browser, the Shazam acoustic fingerprint utility, and the iLife and iWork creativity and productivity suites, as well as professional applications like Final Cut Pro, Logic Pro, and Xcode. Its online services include the iTunes Store, the iOS App Store, Mac App Store, Apple Music, Apple TV+, iMessage, and iCloud. Other services include Apple Store, Genius Bar, AppleCare, Apple Pay, Apple Pay Cash, and Apple Card.", "Apple was founded by Steve Jobs, Steve Wozniak, and Ronald Wayne in April 1976 to develop and sell Wozniak's Apple I personal computer, though Wayne sold his share back within 12 days. It was incorporated as Apple Computer, Inc., in January 1977, and sales of its computers, including the Apple II, grew quickly. Within a few years, Jobs and Wozniak had hired a staff of computer designers and had a production line. Apple went public in 1980 to instant financial success. Over the next few years, Apple shipped new computers featuring innovative graphical user interfaces, such as the original Macintosh in 1984, and Apple's marketing advertisements for its products received widespread critical acclaim. However, the high price of its products and limited application library caused problems, as did power struggles between executives. In 1985, Wozniak departed Apple amicably and remained an honorary employee,", "As the market for personal computers expanded and evolved through the 1990s, Apple lost market share to the lower-priced duopoly of Microsoft Windows on Intel PC clones. The board recruited CEO Gil Amelio to what would be a 500-day charge for him to rehabilitate the financially troubled company—reshaping it with layoffs, executive restructuring, and product focus. In 1997, he led Apple to buy NeXT, solving the desperately failed operating system strategy and bringing Jobs back. Jobs pensively regained leadership status, becoming CEO in 2000. Apple swiftly returned to profitability under the revitalizing Think different campaign, as he rebuilt Apple's status by launching the iMac in 1998, opening the retail chain of Apple Stores in 2001, and acquiring numerous companies to broaden the software portfolio. In January 2007, Jobs renamed the company Apple Inc., reflecting its shifted focus toward consumer electronics, and launched the iPhone to great critical acclaim and financial success. In August 2011, Jobs resigned as CEO due to health complications, and Tim Cook became the new CEO. Two months later, Jobs died, marking the end of an era for the company. In June 2019, Jony Ive, Apple's CDO, left the company to start his own firm, but stated he would work with Apple as its primary client.", "Apple is well known for its size and revenues. Its worldwide annual revenue totaled $265 billion for the 2018 fiscal year. Apple is the world's largest technology company by revenue and one of the world's most valuable companies. It is also the world's third-largest mobile phone manufacturer after Samsung and Huawei. The company also has a high level of brand loyalty and is ranked as the world's most valuable brand. However, Apple receives significant criticism regarding the labor practices of its contractors, its environmental practices and unethical business practices, including anti-competitive behavior, as well as the origins of source materials.", "Apple Computer Company was founded on April 1, 1976, by Steve Jobs, Steve Wozniak, and Ronald Wayne the day before releasing their first computer. :180", "Apple Computer, Inc. was incorporated on January 3, 1977,", "The Apple II, also invented by Wozniak, was introduced on April 16, 1977, at the first West Coast Computer Faire.", "By the end of the 1970s, Apple had a staff of computer designers and a production line. The company introduced the Apple III in May 1980 in an attempt to compete with IBM in the business and corporate computing market.", "Jobs was immediately convinced that all future computers would use a graphical user interface (GUI), and development of a GUI began for the Apple Lisa.", "On December 12, 1980, Apple (ticker symbol \"AAPL\") went public selling 4.6 million shares at $22 per share ($.39 per share when adjusting for stock splits as of March 30, 2019[update]),", "In 1984, Apple launched the Macintosh, the first personal computer to be sold without a programming language.", "Macintosh sales were initially good, but began to taper off dramatically after the first three months due to its high price and limited range of available software.", "The board of directors instructed Sculley to contain Jobs and his ability to launch expensive forays into untested products. Rather than submit to Sculley's direction, Jobs attempted to oust him from his leadership role at Apple.", "The outlook on Macintosh improved with the introduction of the LaserWriter, the first reasonably priced PostScript laser printer, and PageMaker, an early desktop publishing application released in July 1985.", "After the departures of Jobs and Wozniak, the Macintosh product line underwent a steady change of focus to higher price points, the so-called \"high-right policy\" named for the position on a chart of price vs. profits. Jobs had argued the company should produce products aimed at the consumer market and aimed for a $1,000 price for the Macintosh, which they were unable to meet. Newer models selling at higher price points offered higher profit margin, and appeared to have no effect on total sales as power users snapped up every increase in power. Although some worried about pricing themselves out of the market, the high-right policy was in full force by the mid-1980s, notably due to Jean-Louis Gassée's mantra of \"fifty-five or die\", referring to the 55% profit margins of the Macintosh II.", "This policy began to backfire in the last years of the decade as new desktop publishing programs appeared on PC clones that offered some or much of the same functionality of the Macintosh but at far lower price points. The company lost its monopoly in this market and had already estranged many of its original consumer customer base who could no longer afford their high-priced products. The Christmas season of 1989 is the first in the company's history to have declining sales, which led to a 20% drop in Apple's stock price. all of which saw significant sales due to pent-up demand.", "In 1991, Apple introduced the PowerBook, replacing the \"luggable\" Macintosh Portable with a design that set the current shape for almost all modern laptops. The same year, Apple introduced System 7, a major upgrade to the operating system which added color to the interface and introduced new networking capabilities. It remained the architectural basis for the Classic Mac OS. The success of the PowerBook and other products brought increasing revenue.", "Apple believed the Apple II series was too expensive to produce and took away sales from the low-end Macintosh.", "The success of Apple's lower-cost consumer models, especially the LC, also led to cannibalization of their higher priced machines. To address this, management introduced several new brands, selling largely identical machines at different price points aimed at different markets. These were the high-end Quadra, the mid-range Centris line, and the consumer-marketed Performa series. This led to significant market confusion, as customers did not understand the difference between models.", "Apple also experimented with a number of other unsuccessful consumer targeted products during the 1990s, including digital cameras, portable CD audio players, speakers, video consoles, the eWorld online service, and TV appliances. Enormous resources were also invested in the problem-plagued Newton division based on John Sculley's unrealistic market forecasts.[citation needed] Ultimately, none of these products helped and Apple's market share and stock prices continued to slide.[citation needed]", "Throughout this period, Microsoft continued to gain market share with Windows by focusing on delivering software to cheap commodity personal computers, while Apple was delivering a richly engineered but expensive experience.", "By the late 1980s, Apple was developing alternative platforms to System 6, such as A/UX and Pink. The System 6 platform itself was outdated because it was not originally built for multitasking. By the 1990s, Apple was facing competition from OS/2 and UNIX vendors such as Sun Microsystems. System 6 and 7 would need to be replaced by a new platform or reworked to run on modern hardware.", "In 1994, Apple, IBM, and Motorola formed the AIM alliance with the goal of creating a new computing platform (the PowerPC Reference Platform), which would use IBM and Motorola hardware coupled with Apple software. The AIM alliance hoped that PReP's performance and Apple's software would leave the PC far behind and thus counter Microsoft's monopoly. The same year, Apple introduced the Power Macintosh, the first of many Apple computers to use Motorola's PowerPC processor.", "In 1996, Spindler was replaced by Gil Amelio as CEO. Hired for his reputation as a corporate rehabilitator, Amelio made deep changes, including extensive layoffs and cost-cutting.", "At the January 1997 Macworld Expo, Jobs announced that Apple would join Microsoft to release new versions of Microsoft Office for the Macintosh, and that Microsoft had made a $150 million investment in non-voting Apple stock.", "The NeXT acquisition was finalized on February 9, 1997,", "On August 15, 1998, Apple introduced a new all-in-one computer reminiscent of the Macintosh 128K: the iMac. The iMac design team was led by Ive, who would later design the iPod and the iPhone.", "During this period,[when?] Apple completed numerous acquisitions to create a portfolio of digital production software for both professionals and consumers. In 1998, Apple purchased Macromedia's Key Grip software project, signaling an expansion into the digital video editing market. The sale was an outcome of Macromedia's decision to solely focus upon web development software. The product, still unfinished at the time of the sale, was renamed \"Final Cut Pro\" when it was launched on the retail market in April 1999.", "SoundJam MP, released by Casady & Greene in 1998, was renamed \"iTunes\" when Apple purchased it in 2000. The primary developers of the MP3 player and music library software moved to Apple as part of the acquisition, and simplified SoundJam's user interface, added the ability to burn CDs, and removed its recording feature and skin support.", "In 2002, Apple purchased Nothing Real for their advanced digital compositing application Shake,", "Mac OS X, based on NeXT's OPENSTEP and BSD Unix, was released on March 24, 2001, after several years of development. Aimed at consumers and professionals alike, Mac OS X aimed to combine the stability, reliability, and security of Unix with the ease of use afforded by an overhauled user interface. To aid users in migrating from Mac OS 9, the new operating system allowed the use of OS 9 applications within Mac OS X via the Classic Environment.", "On May 19, 2001, Apple opened its first official eponymous retail stores in Virginia and California.", "At the Worldwide Developers Conference keynote address on June 6, 2005, Jobs announced that Apple would begin producing Intel-based Mac computers in 2006.", "Apple's success during this period was evident in its stock price. Between early 2003 and 2006, the price of Apple's stock increased more than tenfold, from around $6 per share (split-adjusted) to over $80.[citation needed] When Apple surpassed Dell's market cap in January 2006,", "Although Apple's market share in computers had grown, it remained far behind its competitor Microsoft Windows, accounting for about 8% of desktops and laptops in the US.[when?][citation needed]", "Since 2001, Apple's design team has progressively abandoned the use of translucent colored plastics first used in the iMac G3. This design change began with the titanium-made PowerBook and was followed by the iBook's white polycarbonate structure and the flat-panel iMac.", "During his keynote speech at the Macworld Expo on January 9, 2007, Jobs announced that Apple Computer, Inc. would thereafter be known as \"Apple Inc.\", because the company had shifted its emphasis from computers to consumer electronics.", "In an article posted on Apple's website on February 6, 2007, Jobs wrote that Apple would be willing to sell music on the iTunes Store without digital rights management (DRM), thereby allowing tracks to be played on third-party players, if record labels would agree to drop the technology.", "In July 2008, Apple launched the App Store to sell third-party applications for the iPhone and iPod Touch.", "On December 16, 2008, Apple announced that 2009 would be the last year the corporation would attend the Macworld Expo, after more than 20 years of attendance, and that senior vice president of Worldwide Product Marketing Phil Schiller would deliver the 2009 keynote address in lieu of the expected Jobs. The official press release explained that Apple was \"scaling back\" on trade shows in general, including Macworld Tokyo and the Apple Expo in Paris, France, primarily because the enormous successes of the Apple Retail Stores and website had rendered trade shows a minor promotional channel.", "On January 14, 2009, Jobs announced in an internal memo that he would be taking a six-month medical leave of absence from Apple until the end of June 2009 and would spend the time focusing on his health. In the email, Jobs stated that \"the curiosity over my personal health continues to be a distraction not only for me and my family, but everyone else at Apple as well\", and explained that the break would allow the company \"to focus on delivering extraordinary products\".", "After years of speculation and multiple rumored \"leaks\", Apple unveiled a large screen, tablet-like media device known as the iPad on January 27, 2010. The iPad ran the same touch-based operating system as the iPhone, and all iPhone apps were compatible with the iPad. This gave the iPad a large app catalog on launch, though having very little development time before the release. Later that year on April 3, 2010, the iPad was launched in the US. It sold more than 300,000 units on its first day, and 500,000 by the end of the first week.", "In June 2010, Apple released the iPhone 4,", "In October 2010, Apple shares hit an all-time high, eclipsing $300 (~$43 split adjusted).", "On January 6, 2011, the company opened its Mac App Store, a digital software distribution platform similar to the iOS App Store.", "On January 17, 2011, Jobs announced in an internal Apple memo that he would take another medical leave of absence for an indefinite period to allow him to focus on his health. Chief Operating Officer Tim Cook assumed Jobs's day-to-day operations at Apple, although Jobs would still remain \"involved in major strategic decisions\". This would be the last product launch Jobs would attend before his death.", "Alongside peer entities such as Atari and Cisco Systems, Apple was featured in the documentary Something Ventured, which premiered in 2011 and explored the three-decade era that led to the establishment and dominance of Silicon Valley.", "On August 24, 2011, Jobs resigned his position as CEO of Apple.", "On October 5, 2011, Steve Jobs died, marking the end of an era for Apple.", "From 2011 to 2012, Apple released the iPhone 4S", "On August 20, 2012, Apple's rising stock price increased the company's market capitalization to a world-record $624 billion. This beat the non-inflation-adjusted record for market capitalization set by Microsoft in 1999.", "A previously confidential email written by Jobs a year before his death was presented during the proceedings of the Apple Inc. v. Samsung Electronics Co. lawsuits and became publicly available in early April 2014. With a subject line that reads \"Top 100 – A,\" the email was sent only to the company's 100 most senior employees and outlines Jobs's vision of Apple Inc.'s future under 10 subheadings. Notably, Jobs declares a \"Holy War with Google\" for 2011 and schedules a \"new campus\" for 2015.", "In March 2013, Apple filed a patent for an augmented reality (AR) system that can identify objects in a live video stream and present information corresponding to these objects through a computer-generated information layer overlaid on top of the real-world image.", "Alongside Google vice-president Vint Cerf and AT&T CEO Randall Stephenson, Cook attended a closed-door summit held by President Obama on August 8, 2013, in regard to government surveillance and the Internet in the wake of the Edward Snowden NSA incident.", "In the first quarter of 2014, Apple reported sales of 51 million iPhones and 26 million iPads, becoming all-time quarterly sales records. It also experienced a significant year-over-year increase in Mac sales. This was contrasted with a significant drop in iPod sales.", "Apple was at the top of Interbrand's annual Best Global Brands report for 6 years in a row; 2013,", "In January 2016, it was announced that one billion Apple devices were in active use worldwide.", "On May 12, 2016, Apple Inc., invested $1 billion in DiDi, a Chinese transportation network company.", "On June 6, 2016, Fortune released Fortune 500, their list of companies ranked on revenue generation. In the trailing fiscal year (2015), Apple appeared on the list as the top tech company.", "On April 6, 2017, Apple launched Clips, an app that allows iPad and iPhone users to make and edit short videos with text, graphics and effects. The app provides a way to produce short videos to share with other users on the Messages app, Instagram, Facebook, and other social networks. Apple also introduced Live Titles for Clips that allows users to add live animated captions and titles using their voice.", "In May 2017, Apple refreshed two of its website designs. Their public relations \"Apple Press Info\" website was changed to an \"Apple Newsroom\" site, featuring a greater emphasis on imagery and therefore lower information density, and combines press releases, news items, and photos. Its \"Apple Leadership\" overview of company executives was also refreshed, adding a simpler layout with a prominent header image and two-column text fields. 9to5Mac noted the design similarities to several of Apple's redesigned apps in iOS 10, particularly its Apple Music and News software.", "In June 2017, Apple announced the HomePod, its smart speaker aimed to compete against Sonos Google Home and Amazon Echo.", "Also in June 2017, Apple appointed Jamie Erlicht and Zack Van Amburg to head the newly formed worldwide video unit. In November 2017, Apple announced it was branching out into original scripted programming: a drama series starring Jennifer Aniston and Reese Witherspoon, and a reboot of the anthology series Amazing Stories with Steven Spielberg. , Apple has ordered twenty-one television series and one film. There are five series in development at Apple.", "On June 5, 2018, Apple deprecated OpenGL and OpenGL ES across all operating systems and urged developers to use Metal instead.", "In August 2018, Apple purchased Akonia Holographics for its augmented reality goggle lens.", "On January 29, 2019, Apple reported its first decline in revenues and profits in a decade.", "In February 2019 they bought Conversational computing company PullString (formerly ToyTalk)", "On July 25, 2019, Apple and Intel announced an agreement for Apple to acquire the smartphone modem business of Intel Mobile Communications for US$1 billion.", "Macintoshes currently in production:", "Apple sells a variety of computer accessories for Macs, including Thunderbolt Display, Magic Mouse, Magic Trackpad, Magic Keyboard, the AirPort wireless networking products, and Time Capsule.", "On October 23, 2001, Apple introduced the iPod digital music player. Several updated models have since been introduced, and the iPod brand is now the market leader in portable music players by a significant margin. More than 390 million units have shipped as of September 2015[update]. Apple has partnered with Nike to offer the Nike+iPod Sports Kit, enabling runners to synchronize and monitor their runs with iTunes and the Nike+ website.", "In late July 2017, Apple discontinued its iPod Nano and iPod Shuffle models, leaving only the iPod Touch available for purchase.", "At the Macworld Conference & Expo in January 2007, Steve Jobs introduced the long-anticipated", "A second version, the iPhone 3G, was released on July 11, 2008, with a reduced price of $199 for the 8 GB model and $299 for the 16 GB model. On June 8, 2009, Apple announced the iPhone 3GS. It provided an incremental update to the device, including faster internal components, support for faster 3G speeds, video recording capability, and voice control.", "At the Worldwide Developers Conference (WWDC) on June 7, 2010, Apple announced the redesigned iPhone 4.", "On September 12, 2012, Apple introduced the iPhone 5.", "A patent filed in July 2013 revealed the development of a new iPhone battery system that uses location data in combination with data on the user's habits to moderate the handsets power settings accordingly. Apple is working towards a power management system that will provide features such as the ability of the iPhone to estimate the length of time a user will be away from a power source to modify energy usage and a detection function that adjusts the charging rate to best suit the type of power source that is being used.", "In a March 2014 interview, Apple designer Jonathan Ive used the iPhone as an example of Apple's ethos of creating high-quality, life-changing products. He explained that the phones are comparatively expensive due to the intensive effort that is used to make them:", "On September 9, 2014, Apple introduced the iPhone 6, alongside the iPhone 6 Plus that both have screen sizes over 4-inches.", "In July 2016, Apple announced that one billion iPhones had been sold.", "On September 7, 2016, Apple introduced the iPhone 7 and the iPhone 7 Plus, which feature improved system and graphics performance, add water resistance, a new rear dual-camera system on the 7 Plus model, and, controversially, remove the 3.5 mm headphone jack.", "On September 12, 2017, Apple introduced the iPhone 8 and iPhone 8 Plus, standing as evolutionary updates to its previous phones with a faster processor, improved display technology, upgraded camera systems and wireless charging.", "On September 12, 2018, Apple introduced the iPhone XS, iPhone XS Max and iPhone XR. The iPhone XS and iPhone XS Max features Super Retina displays, a faster and improved dual camera system that offers breakthrough photo and video features, the first 7-nanometer chip in a smartphone — the A12 Bionic chip with next-generation Neural Engine — faster Face ID, wider stereo sound and introduces Dual SIM to iPhone. The iPhone XR comes in an all-screen glass and aluminium design with the most advanced LCD in a smartphone featuring a 6.1-inch Liquid Retina display, A12 Bionic chip with next-generation Neural Engine, the TrueDepth camera system, Face ID and an advanced camera system that creates dramatic portraits using a single camera lens.", "On September 10, 2019, Apple introduced the iPhone 11, iPhone 11 Pro, and the iPhone 11 Pro Max. The iPhone 11 features the same Liquid Retina LCD display used in 2018's iPhone XR. Overall, the iPhone 11 retains the same glass and aluminum design as the iPhone XR while adding in new features such as the addition of an Ultra Wide 12mp camera, a battery that lasts 1 hour longer than the iPhone XR and an IP 68 rating. The iPhone 11 Pro and iPhone 11 Pro Max features an all new textured matte glass and stainless steel design and a triple camera setup that included an Ultra Wide, Wide and Telephoto camera. The iPhone 11 Pro series' battery life was capable of lasting up to 5 hours more than the iPhone XS and XS Max. The iPhone 11 Pro and Pro Max also features a new Super Retina XDR OLED display that was capable of a screen brightness of 800 nits. All new iPhones announced at Apple's September 2019 feature an A13 Bionic chip with a third generation Neural Engine, an Apple U1 chip, spatial audio playback, a low light photo mode and an improved Face ID system.", "On January 27, 2010, Apple introduced their much-anticipated media tablet, the iPad.", "On March 2, 2011, Apple introduced the iPad 2, which had a faster processor and a camera on the front and back. It also added support for optional 3G service provided by Verizon in addition to AT&T.", "The third-generation iPad was released on March 7, 2012, and marketed as \"the new iPad\". It added LTE service from AT&T or Verizon, an upgraded A5X processor, and Retina display. The dimensions and form factor remained relatively unchanged, with the new iPad being a fraction thicker and heavier than the previous version and featuring minor positioning changes.", "On October 23, 2012, Apple's fourth-generation iPad came out, marketed as the \"iPad with Retina display\". It added the upgraded A6X processor and replaced the traditional 30-pin dock connector with the all-digital Lightning connector.", "On October 22, 2013, Apple introduced the iPad Air and the iPad Mini with Retina Display, both featuring a new 64-bit Apple A7 processor.", "The iPad Air 2 was unveiled on October 16, 2014. It added better graphics and central processing and a camera burst mode as well as minor updates. The iPad Mini 3 was unveiled at the same time.", "Since its launch, iPad users have downloaded over three billion apps. The total number of App Store downloads, as of June 2015[update], is over 100 billion.", "On September 9, 2015, Apple announced the iPad Pro, an iPad with a 12.9-inch display that supports two new accessories, the Smart Keyboard and Apple Pencil.", "The original Apple Watch smartwatch was announced by Tim Cook on September 9, 2014, being introduced as a product with health and fitness-tracking.", "The second generation of Apple Watch, Apple Watch Series 2, was released in September 2016, featuring greater water resistance, a faster processor, and brighter display. It was also released alongside a cheaper Series 1.", "On September 12, 2017, Apple introduced the Apple Watch Series 3 featuring LTE cellular connectivity, giving the wearable independence from an iPhone", "On September 12, 2018, Apple introduced the Apple Watch Series 4, featuring new display, electrocardiogram, and fall detection."]}
]