[
    {
        "name": "Facebook Messenger",
        "text": "Facebook Messenger (commonly known as Messenger)[9] is a messaging app and platform developed by Facebook, Inc. Originally developed as Facebook Chat in 2008, the company revamped its messaging service in 2010, and subsequently released standalone iOS and Android apps in August 2011 and standalone Facebook Portal hardware for Messenger-based calling in Q4 2018. Over the years, Facebook has released new apps on a variety of different operating systems, launched a dedicated website interface (Messenger.com), and separated the messaging functionality from the main Facebook app, allowing users to use the web interface or download one of the standalone apps.Users can send messages and exchange photos, videos, stickers, audio, and files, as well as react to other users' messages and interact with bots. The service also supports voice and video calling. The standalone apps support using multiple accounts, conversations with optional end-to-end encryption, and playing games.Following tests of a new instant messaging platform on Facebook in March 2008,[10][11] the feature, then-titled \"Facebook Chat\", was gradually released to users in April 2008.[12][13] Facebook revamped its messaging platform in November 2010,[14] and subsequently acquired group messaging service Beluga in March 2011,[15] which the company used to launch its standalone iOS and Android mobile apps on August 9, 2011.[16][17] Facebook later launched a BlackBerry version in October 2011.[18][19] An app for Windows Phone, though lacking features including voice messaging and chat heads, was released in March 2014.[20][21] In April 2014, Facebook announced that the messaging feature would be removed from the main Facebook app and users will be required to download the separate Messenger app.[22][23] An iPad-optimized version of the iOS app was released in July 2014.[24][25] In April 2015, Facebook launched a website interface for Messenger.[26][27] A Tizen app was released on July 13, 2015.[28] Facebook launched Messenger for Windows 10 in April 2016.[29] In October 2016, Facebook released Facebook Messenger Lite, a stripped-down version of Messenger with a reduced feature set. The app is aimed primarily at old Android phones and regions where high-speed Internet is not widely available. In April 2017, Facebook Messenger Lite was expanded to 132 more countries.[30][31] In May 2017, Facebook revamped the design for Messenger on Android and iOS, bringing a new home screen with tabs and categorization of content and interactive media, red dots indicating new activity, and relocated sections.[32][33]Facebook announced a Messenger program for Windows 7 in a limited beta test in November 2011.[34][35] The following month, Israeli blog TechIT leaked a download link for the program, with Facebook subsequently confirming and officially releasing the program.[36][37] The program was eventually discontinued in March 2014.[38][39] A Firefox web browser add-on was released in December 2012,[40] but was also discontinued in March 2014.[41]In December 2017, Facebook announced Messenger Kids, a new app aimed for persons under 13 years of age. The app comes with some differences compared to the standard version.The following is a table of features available in Facebook Messenger, as well as their geographical coverage and what devices they are available on:In April 2016, Facebook announced a bot platform for Messenger, including an API to build chat bots to interact with users. News publisher bots \"message subscribers directly with news and other information\",[85][86] while ride-sharing apps can offer a transportation option, hotel chains can answer questions about accommodations, and air travel companies can allow for check-ins, flight updates and travel changes.[87]At the 2017 Facebook F8 conference, Facebook announced a range of enhancements for bots:The slightly renamed \"Discover\" tab was officially launched in the United States in late June 2017.[92][93]In January 2017, Facebook announced that it was testing showing advertisements in Facebook Messenger's home feed. At the time, the testing was limited to a \"small number of users in Australia and Thailand\", with the ad format being swipe-based carousel ads.[117][118][119] In July, the company announced that they were expanding the testing to a global audience. Stan Chudnovsky, head of Messenger, told VentureBeat that \"We’ll start slow ... When the average user can be sure to see them we truly don’t know because we’re just going to be very data-driven and user feedback-driven on making that decision\".[120][121] Facebook told TechCrunch that the advertisements' placement in the inbox depends on factors such as thread count, phone screen size, and pixel density.[122] In a TechCrunch editorial by Devin Coldewey, he described the ads as \"huge\" in the space they occupy, \"intolerable\" in the way they appear in the user interface, and \"irrelevant\" due to the lack of context. Coldewey finished by writing \"Advertising is how things get paid for on the internet, including TechCrunch, so I’m not an advocate of eliminating it or blocking it altogether. But bad advertising experiences can spoil a perfectly good app like (for the purposes of argument) Messenger. Messaging is a personal, purposeful use case and these ads are a bad way to monetize it.\"[123]In November 2014, the Electronic Frontier Foundation (EFF) listed Facebook Messenger (Facebook chat) on its Secure Messaging Scorecard. It received a score of 2 out of 7 points on the scorecard. It received points for having communications encrypted in transit and for having recently completed an independent security audit. It missed points because the communications were not encrypted with keys the provider didn't have access to, users could not verify contacts' identities, past messages were not secure if the encryption keys were stolen, the source code was not open to independent review, and the security design was not properly documented.[124][125][126]As stated by Facebook in its Help Center, there is no way to log out of the Facebook Messenger application. Instead, users can choose between different availability statuses, including \"Appear as inactive\", \"Switch accounts\", and \"Turn off notifications\".[127] Media outlets have reported on a workaround, by pressing a \"Clear data\" option in the application's menu in Settings on Android devices, which returns the user to the log-in screen.[128][129]After being separated from the main Facebook app, Facebook Messenger had 600 million users in April 2015.[56] This grew to 900 million in June 2016,[84] 1 billion in July 2016,[130][131] and 1.2 billion in April 2017.[132][133]In early 2018, the US Department of Justice went to court to attempt to force Facebook to modify its Messenger app to enable surveillance by third parties so that agents could listen in on encrypted voice conversations over Messenger. [134]:1 The court decided against the Justice Department, but sealed the case. [135]:1 In November 2018, the ACLU and EFF filed suit to have the case unsealed so that the public can be informed about the encryption/surveillance debate. [136] [137] [138]:1"
    },
    {
        "name": "Instagram",
        "text": "Instagram (also known informally as IG or Insta[10]) is an American photo and video-sharing social networking service owned by Facebook, Inc. It was created by Kevin Systrom and Mike Krieger, and launched in October 2010 exclusively on iOS. A version for Android devices was released a year and half later, in April 2012, followed by a feature-limited website interface in November 2012, and apps for Windows 10 Mobile and Windows 10 in April 2016 and October 2016 respectively. The app allows users to upload photos and videos to the service, which can be edited with various filters, and organized with tags and location information. An account's posts can be shared publicly or with pre-approved followers. Users can browse other users' content by tags and locations, and view trending content. Users can like photos, and follow other users to add their content to a feed.The service was originally distinguished by only allowing content to be framed in a square (1:1) aspect ratio with 640 pixels to match the display width of the iPhone 4, 4s, 5, 5s and SE, these restrictions were later eased in 2015 with an increase to 1080 pixels. The service also added messaging features, the ability to include multiple images or videos in a single post, as well as \"Stories\"—similar to its main competitor Snapchat—which allows users to post photos and videos to a sequential feed, with each post accessible by others for 24 hours each. As of January 2019, the Stories feature is being used by 500 million users daily.[11]After its launch in 2010, Instagram rapidly gained popularity, with one million registered users in two months, 10 million in a year, and 1 billion as of May 2019. In April 2012, Facebook acquired the service for approximately US$1 billion in cash and stock. As of October 2015, over 40 billion photos had been uploaded to the service. Although praised for its influence, Instagram has been the subject of criticism, most notably for policy and interface changes, allegations of censorship, and illegal or improper content uploaded by users.As of December 2019, the most-followed person is footballer Cristiano Ronaldo with over 191 million followers, and the most-followed woman is singer Ariana Grande with over 168 million followers.As of January 14, 2019, the most liked photo on Instagram is a picture of an egg, posted by the account @world_record_egg, created with the sole purpose of surpassing the previous record of 18 million likes on a Kylie Jenner post. The picture currently has over 53 million likes.[12]Instagram began development in San Francisco, when Kevin Systrom and Mike Krieger chose to focus their multi-featured HTML5 check-in project, Burbn, on mobile photography. As Krieger reasoned, Burbn became too similar to Foursquare, and both realized that it had gone too far. Burbn was then pivoted to become more focused on photo-sharing.[13] The word Instagram is a portmanteau of instant camera and telegram.[13]On March 5, 2010, Systrom closed a $500,000 seed funding round with Baseline Ventures and Andreessen Horowitz while working on Burbn.[14] Josh Riedel joined the company in October as Community Manager,[15] Shayne Sweeney joined in November as an engineer,[15] and Jessica Zollman joined as a Community Evangelist in August 2011.[15][16]The first Instagram post was a photo of South Beach Harbor at Pier 38, posted by Mike Krieger on July 16, 2010 at 5:26 PM.[17][18]Kevin Systrom's first post, which came a few hours later (9:24 PM), has been wrongly attributed as the first Instagram photo due to the earlier letter of the alphabet in its URL.[19][20] This photo shows a dog in Mexico and Systrom's girlfriend's foot. The photo had been passed through Instagram's X-PRO2 filter.[21]On October 6, 2010, the Instagram iOS app was officially released through the App Store.[22][23]In February 2011, it was reported that Instagram had raised $7 million in Series A funding from a variety of investors, including Benchmark Capital, Jack Dorsey, Chris Sacca (through Capital fund), and Adam D'Angelo.[24] The deal valued Instagram at around $20 million.[25] In March 2012, The Wall Street Journal reported that Instagram was raising a new round of financing that would value the company at $500 million,[26] details that were confirmed the following month, when Instagram raised $50 million from venture capitalists with a $500 million valuation.[27] Joshua Kushner was the second largest investor in Instagram's Series B fundraising round, leading his investment firm Thrive Capital to double its money, after the sale to Facebook.[28]On April 3, 2012, Instagram was released for Android phones,[29][30] and it was downloaded more than one million times in less than one day.[31]On April 9, 2012, Facebook, Inc. bought Instagram for $1 billion in cash and stock,[32][33][34] with a plan to keep the company independently managed.[35][36][37] Britain's Office of Fair Trading approved the deal on August 14, 2012,[38] and on August 22, 2012, the Federal Trade Commission in the U.S. closed its investigation, allowing the deal to proceed.[39] On September 6, 2012, the deal between Instagram and Facebook was officially closed.[40]The deal, which was made just prior to Facebook's scheduled IPO, cost about a quarter of Facebook's cash-on-hand, according to figures documented at the end of 2011.[37] The deal was for a company characterized as having \"lots of buzz but no business model\", and the price was contrasted with the $35 million Yahoo! paid for Flickr in 2005.[37] Mark Zuckerberg noted that Facebook was \"committed to building and growing Instagram independently\", in contrast to its past practices.[37] According to Wired, the deal netted Systrom $400 million based on his ownership stake in the business.[41] The exact purchase price was $300 million in cash and 23 million shares of stock.[42]In November 2012, Instagram launched website profiles, allowing anyone to see users' feeds from their web browsers. However, the website interface was limited in functionality, with notable omissions including the lack of a search bar, a news feed, and the ability to upload photos.[43] In February 2013, the website was updated to offer a news feed,.[44]The Android app has received two major exclusive updates. The first, introduced in March 2014, cut the size of the app by half and added significant improvements to performance and responsiveness on a wide variety of Android devices.[45][46] The Verge wrote that the development team had tested the app on devices not for sale in the United States, particularly low-end models like Samsung Galaxy Y, in an effort to improve the app for its userbase located outside the U.S. Engineering manager Philip McAllister told The Verge that \"More than 60 percent of our users are outside the US, and Android covers roughly half of total Instagram users\".[47] The second update, introduced in April 2017, added an offline mode, in which content previously loaded in the news feed is available without an Internet connection, and users can comment, like, save media, and unfollow users, all of which will take effect once the user goes back online. At the time of the announcement, it was reported that 80% of Instagram's 600 million users are located outside the U.S., and while the aforementioned functionality was live at announcement, Instagram also announced its intention to make more features available offline \"in the following months\", and that they were \"exploring an iOS version\".[48][49][50]Since the app's launch it had used the Foursquare API technology to provide named location tagging. In March 2014, Instagram started testing switching the technology to using Facebook Places.[51][52]In June 2015, the desktop website user interface was redesigned to become more flat and minimalistic, but with more screen space for each photo and to resemble the layout of Instagram's mobile website.[53][54][55] Furthermore, one row of pictures only has three instead of five photos to match the mobile layout. The slideshow banner[56][57] on the top of profile pages, which simultaneously slide-showed seven picture tiles of pictures posted by the user, alternating at different times in a random order, has been removed. In addition, the formerly angular profile pictures became circular, following an ongoing design trend,On May 11, 2016, Instagram revamped its design, adding a black-and-white flat design theme for the app's user interface, and a lesser skeuomorphistic, more abstract, \"modern\" and colorful icon.[58][59][60] Rumors of a redesign first started circulating in April, when The Verge received a screenshot from a tipster, but at the time, an Instagram spokesperson simply told the publication that \"This is a design test only\".[61]On June 1, 2016, Instagram applied new restrictions to their API[62][63] that were announced on November 17, 2015.[64][65] These restrictions included:[62]Announced in March 2016 and taking place in June, Instagram switched from a strictly chronological oldest-to-newest news feed to a new, algorithm-based feed. The change received \"widespread outcry\" following Instagram's March announcement, but Instagram stated that the feature would help users discover lost posts, writing that \"You may be surprised to learn that people miss on average 70 percent of their feeds. As Instagram has grown, it's become harder to keep up with all the photos and videos people share. This means you often don't see the posts you might care about the most. To improve your experience, your feed will soon be ordered to show the moments we believe you will care about the most.\"[66][67][68]On December 6, 2016, Instagram introduced comment liking, which are similar to upvotes. However, unlike post likes, the user who posted a comment does not receive notifications about comment likes in their notification inbox. Uploaders can optionally decide to deactivate comments onto a post[69][70][71]In April 2016, Instagram released a Windows 10 Mobile app, after years of demand from Microsoft and the public to release an app for the platform.[72][73] The platform previously had a beta version of Instagram, first released on November 21, 2013 and also compatible with Windows Phone 8.[74][75][76] The new app added support for video (viewing and creating posts or stories, and viewing live streams), album posts and direct messages.[77] Similarly, an app for Windows 10 personal computers and tablets was released in October 2016.[78][79] On April 30, 2019, the Windows 10 Mobile app was discontinued, though the mobile website remains available as a progressive web application with limited functionality. The app also remains available on Windows 10 computers and tablets.On September 24, 2018, Krieger and Systrom announced in a statement they would be stepping down from Instagram.[80][81] On October 1, 2018, it was announced that Adam Mosseri would be the new head of Instagram.[82][83]On November 28, 2018, Instagram added alternative text features to photo posts allowing visually impaired users to listen to descriptions of each photo which has alternative text, either automatically generated text or user-inputted text.[84][85][86]In October 2019, Instagram was updated with a dark mode that syncs with iOS 13 and Android 10.[87][88]Users can upload photographs and short videos, follow other users' feeds,[89] and geotag images with the name of a location.[90] Users can set their account as \"private\", thereby requiring that they approve any new follower requests.[91] Users can connect their Instagram account to other social networking sites, enabling them to share uploaded photos to those sites.[92] In January 2011, Instagram introduced hashtags to help users discover both photos and each other.[93][94] Instagram encourages users to make tags both specific and relevant, rather than tagging generic words like \"photo\", to make photographs stand out and to attract like-minded Instagram users.[95] In September 2011, a new version of the app included new and live filters, instant tilt–shift, high-resolution photographs, optional borders, one-click rotation, and an updated icon.[96][97] In August 2015, Instagram started allowing users to upload full-size landscape and portrait photos and videos onto the service, dropping the previous requirement of a square frame.[98][99][100] In August 2016, Instagram added a zoom feature that allows users to pinch-to-zoom the screen to virtually zoom in on photos and videos.[101][102] In September 2016, Instagram removed Photo Maps, which previously allowed users to see a map of their geotagged photos. An Instagram spokesperson stated that \"Photo Map was not widely used, so we've decided to remove the feature and focus on other priorities\".[103][104] In December 2016, Instagram introduced a feature letting users save photos for later viewing. Bookmarked posts get added to a private page in the app.[105][106] The feature was updated in April 2017 to let users organize saved posts into different collections.[107][108]In February 2017, Instagram announced that users would be able to upload up to ten pictures or videos to one post, with the content appearing as a swipeable carousel.[109][110] The feature originally limited photos to the square format, but received an update in August to enable portrait and landscape photos instead.[111][112] In May, Instagram updated its mobile website to allow users to upload photos, and to add a \"lightweight\" version of the Explore tab.[113][114] Later in May, Instagram added an \"Archive\" feature, letting users hide posts in a private storage area, out of visibility for the public and other users. The move was seen as a way to prevent users from deleting photos that don't garner a desired number of \"likes\" or are deemed boring, but also as a way to limit the \"emergent behavior\" of deleting photos, which deprives the service of content.[115][116] In August, Instagram announced that it would start organizing comments into threads, letting users more easily interact with replies.[117][118] In April 2018, Instagram launched its version of a portrait mode called \"focus mode,\" which gently blurs the background of a photo or video while keeping the subject in focus when selected.[119]Instagram shopping allows users to tap on a product they like in Stories and Feed and click a tag that takes them to the company's product list. Users can also build a shopping list inside the platform by tapping on a tag and saving it.[120] The Checkout feature was added in a later stage which allows users to buy products in app.[121] In 2019, Apple pulled app that let users stalk people on Instagram by scraping accounts and collecting data.[1]In June 2012, Instagram introduced \"Explore\", a tab inside the app that displays popular photos, photos taken at nearby locations, and search.[122] The tab was updated in June 2015 to feature trending tags and places, curated content, and the ability to search for locations.[123] In April 2016, Instagram added a \"Videos You Might Like\" channel to the tab,[124][125] followed by an \"Events\" channel in August, featuring videos from concerts, sports games, and other live events,[126][127] followed by the addition of Instagram Stories in October.[128][129] The tab was later expanded again in November 2016 after Instagram Live launched to display an algorithmically-curated page of the \"best\" Instagram Live videos currently airing.[130] In May 2017, Instagram once again updated the Explore tab to promote public Stories content from nearby places.[131]Instagram offers a number of photographic filters that users can apply to their images:In February 2012, Instagram added a \"Lux\" filter, an effect that \"lightens shadows, darkens highlights and increases contrast\".[141][142]In December 2014, Slumber, Crema, Ludwig, Aden, and Perpetua were five new filters to be added to the Instagram filter family.[143]Initially a purely photo-sharing service, Instagram incorporated 15-second video sharing in June 2013.[144][145] The addition was seen by some in the technology media as Facebook's attempt at competing with then-popular video-sharing application Vine.[146][147] In August 2015, Instagram added support for widescreen videos.[148][149] In March 2016, Instagram increased the 15-second video limit to 60 seconds.[150][151] Albums were introduced in February 2017, which allow up to 10 minutes of video to be shared in one post.[109][110][152]IGTV is a vertical video application launched by Instagram[153] in June 2018. Basic functionality is also available within the Instagram app and website. IGTV allows uploads of up to 10 minutes in length with a file size of up to 650 MB, with verified and popular users allowed to upload videos of up to 60 minutes in length with a file size of up to 5.4 GB.[154] The app automatically begins playing videos as soon as it is launched, which CEO Kevin Systrom contrasted to video hosts where one must first locate a video.[155][156][157]In December 2013, Instagram announced Instagram Direct, a feature that lets users interact through private messaging. Users who follow each other can send private messages with photos and videos, in contrast to the public-only requirement that was previously in place. When users receive a private message from someone they don't follow, the message is marked as pending and the user must accept to see it. Users can send a photo to a maximum of 15 people.[158][159][160] The feature received a major update in September 2015, adding conversation threading and making it possible for users to share locations, hashtag pages, and profiles through private messages directly from the news feed. Additionally, users can now reply to private messages with text, emoji or by clicking on a heart icon. A camera inside Direct lets users take a photo and send it to the recipient without leaving the conversation.[161][162][163] A new update in November 2016 let users make their private messages \"disappear\" after being viewed by the recipient, with the sender receiving a notification if the recipient takes a screenshot.[164][165] In April 2017, Instagram redesigned Direct to combine all private messages, both permanent and ephemeral, into the same message threads.[166][167][168] In May, Instagram made it possible to send website links in messages, and also added support for sending photos in their original portrait or landscape orientation without cropping.[169][170]In August 2016, Instagram launched Instagram Stories, a feature that allows users to take photos, add effects and layers, and add them to their Instagram story. Images uploaded to a user's story expire after 24 hours. The media noted the feature's similarities to Snapchat.[171][172]In November, Instagram added live video functionality to Instagram Stories, allowing users to broadcast themselves live, with the video disappearing immediately after ending.[173][130]In January 2017, Instagram launched skippable ads, where five-second photo and 15-second video ads appear in-between different stories.[174][175]In April 2017, Instagram Stories incorporated augmented reality stickers, a \"clone\" of Snapchat's functionality.[176][177][178]In May 2017, Instagram expanded the augmented reality sticker feature to support face filters, letting users add specific visual features onto their faces.[179][180]Later in May, TechCrunch reported about tests of a Location Stories feature in Instagram Stories, where public Stories content at a certain location are compiled and displayed on a business, landmark or place's Instagram page.[181] A few days later, Instagram announced \"Story Search\", in which users can search for geographic locations or hashtags and the app displays relevant public Stories content featuring the search term.[131][182]In June 2017, Instagram revised its live-video functionality to allow users to add their live broadcast to their story for availability in the next 24 hours, or discard the broadcast immediately.[183] In July, Instagram started allowing users to respond to Stories content by sending photos and videos, complete with Instagram effects such as filters, stickers, and hashtags.[184][185]Stories were made available for viewing on Instagram's mobile and desktop websites in late August 2017.[186][187]On December 5, 2017, Instagram introduced “Story Highlights”,[188][189] also known as “Permanent Stories”, which are similar to Instagram Stories, but don't expire. They appear as circles below the profile picture and biography, and are accessible from the desktop website as well.In June 2018, the daily active story users of Instagram had reached to 400 million users, and monthly active users had reached to 1 billion active users.[190]In response to criticism that it copied functionality from Snapchat, CEO Kevin Systrom told Recode that \"Day One: Instagram was a combination of Hipstamatic, Twitter [and] some stuff from Facebook like the 'Like' button. You can trace the roots of every feature anyone has in their app, somewhere in the history of technology\". Although Systrom acknowledged the criticism as \"fair\", Recode wrote that \"he likened the two social apps' common features to the auto industry: Multiple car companies can coexist, with enough differences among them that they serve different consumer audiences\". Systrom further stated that \"When we adopted [Stories], we decided that one of the really annoying things about the format is that it just kept going and you couldn't pause it to look at something, you couldn't rewind. We did all that, we implemented that.\" He also told the publication that Snapchat \"didn't have filters, originally. They adopted filters because Instagram had filters and a lot of others were trying to adopt filters as well.\"[191][192]Following Emily White's appointment to the position of Director of Business Operations in April 2013,[193][194] she stated in an interview with The Wall Street Journal in September 2013 that the company should be ready to begin selling advertising by September 2014 as a way to generate business from a popular entity that had not yet created profit for its parent company.[195] White left Instagram, however, in December 2013, to join Snapchat.[196][197] In August 2014, James Quarles was hired as Instagram's Global Head of Business and Brand Development, a new position within the company focused on overseeing advertisement and sales efforts while developing new \"monetization products\", according to a spokesperson.[198]In October 2013, Instagram began its monetization efforts, announcing that, \"over the next couple of months\", video and image ads would start appearing in between users' photos in the news feed for users in the United States.[199][200] A sample ad from Instagram, featuring the text \"Sponsored\" at the top right of the image, was the first to be released, with a limited number of brands being allowed to advertise in the early stages.[201][202] Image advertisements officially started appearing in feeds starting November 1, 2013,[203][204] followed by video ads on October 30, 2014.[205][206] In June 2014, Instagram announced the then-upcoming rollout of ads in the United Kingdom, Canada and Australia, planned for \"later this year\".[207] The same sample ad from Instagram's launch in the U.S. was shown to users in the United Kingdom in September 2014, with ads rolling out \"over the coming weeks\".[208]In March 2015, it announced that it would allow advertisers to buy \"carousel ads\", a way for brands to upload up to five images that users can swipe through, with options at the end for additional content or a visit to the brand's website.[209][210] Following strong performance of the ad format, Instagram opened up a self-service feature for brands to buy carousel ads the following October,[211][212] and in March 2016, it started allowing video in carousel ads.[213]In May 2016, Instagram announced the launch of new tools for business accounts, including new business profiles, Insights analytics and the ability to turn posts into ads directly from the Instagram app itself. However, to be eligible for the tools, businesses had to have a Facebook Page, with Quarles stating: \"In doing that, it gives us the payment credentials, as well as if they want to prepopulate some of the information like their street address, the phone number, and the website\".[214] The Instagram Insights panel, which lets businesses see their top posts, reach, impressions and engagement surrounding their posts as well as user demographics,[214] was rolled out first to the United States, Australia, and New Zealand, with the rest of the world \"by the end of the year\".[215][214][216]In February 2016, Instagram announced that it had 200,000 advertisers on the platform.[217] This increased to 500,000 active advertisers in September 2016,[218] and one million in March 2017.[219][220]Instagram has developed and released three stand-alone apps with specialized functionality. In July 2014, it released Bolt, a messaging app where users click on a friend's profile photo to quickly send an image, with the content disappearing after being seen.[221][222] It was followed by the release of Hyperlapse in August, an iOS-exclusive app that uses \"clever algorithm processing\" to create tracking shots and fast time-lapse videos.[223][224] Microsoft launched a Hyperlapse app for Android and Windows in May 2015, but there has been no official Hyperlapse app from Instagram for either of these platforms to date.[225] In October 2015, it released Boomerang, a video app that combines photos into short, one-second videos that play back-and-forth in a loop.[226][227]The popularity of Instagram has led to a variety of third-party services using its functionality and adopting it into formats not officially supported. Examples include services for getting an overview of user statistics, printing photos at social events, turning a large number of photos into thumbnails for a physical book or a large poster, and dedicated apps for viewing Instagram on Mac personal computers.[228]Following the release in October, Instagram had one million registered users in December 2010.[229][230] In June 2011, it announced that it had 5 million users,[231] which increased to 10 million in September.[232][233] This growth continued to 30 million users in April 2012,[232][29] 80 million in July 2012,[234][235] 100 million in February 2013,[236][237] 130 million in June 2013,[238] 150 million in September 2013,[239][240] 300 million in December 2014,[241][242] 400 million in September 2015,[243][244] 500 million in June 2016,[245][246] 600 million in December 2016,[247][248] 700 million in April 2017,[249][250] and 800 million in September 2017.[251][252]In October 2016, Instagram Stories reached 100 million active users, two months after launch.[253][254] This increased to 150 million in January 2017,[174][175] 200 million in April, surpassing Snapchat's user growth,[176][177][178] and 250 million active users in June 2017.[255][183]In April 2017, Instagram Direct had 375 million monthly users.[166][167][168]In June 2011, Instagram passed 100 million photos uploaded to the service.[256][257] This grew to 150 million in August 2011,[258][259] and by June 2013, there were over 16 billion photos on the service.[238] In October 2015, there existed over 40 billion photos.[260]On August 9, 2012, English musician Ellie Goulding released a new music video for her song \"Anything Could Happen.\" The video only contained fan-submitted Instagram photographs that used various filters to represent words or lyrics from the song, and over 1,200 different photographs were submitted.[261]Instagram was listed among Time's \"50 Best Android Applications for 2013\" list.[262]Instagram's users are divided equally with 50% iPhone owners and 50% Android owners. While Instagram has a neutral gender-bias format, 68% of Instagram users are female while 32% are male. Instagram's geographical use is shown to favor urban areas as 17% of US adults who live in urban areas use Instagram while only 11% of adults in suburban and rural areas do so. While Instagram may appear to be one of the most widely used sites for photo sharing, only 7% of daily photo uploads, among the top four photo-sharing platforms, come from Instagram. Instagram has been proven to attract the younger generation with 90% of the 150 million users under the age of 35. From June 2012 to June 2013, Instagram approximately doubled their number of users. As regards income, 15% of US Internet users who make less than $30,000 per year use Instagram, while 14% of those making $30,000 to $50,000, and 12% of users who make more than $50,000 per year do so.[263] With respect to the education demographic, respondents with some college education proved to be the most active on Instagram with 23%. Following behind, college graduates consist of 18% and users with a high school diploma or less make up 15%. Among these Instagram users, 24% say they use the app several times a day.[264][needs update]Ongoing research continues to explore how media content on the platform affects user engagement. Past research has found that media which show peoples' faces receive more 'likes' and comments and that using filters that increase warmth, exposure, and contrast also boosts engagement.[265] Users are more likely to engage with images that depict fewer individuals compared to groups and also are more likely to engage with content that has not been watermarked, as they view this content as less original and reliable compared to user-generated content.[266] Recently Instagram has come up with an option for users to apply for verified account badge, however this does not guarantee every user who applies will get the verified blue tick.[267] In October 2019, Instagram announced that it would remove the 'Following' tab that allowed users to see the likes and comments of accounts they followed. Instagram's head of product, Vishal Shah, explained the change: \"People didn’t always know that their activity is surfacing. So you have a case where it’s not serving the use case you built if for, but it’s also causing people to be surprised when their activity is showing up.\" [268]Users on Instagram have created \"trends\" through hashtags, which are specific keywords combined with a hash symbol that lets them share content with other Instagram users. The trends deemed the most popular on the platform often highlight a specific day of the week to post the material on. Examples of popular trends include #SelfieSunday, in which users post a photo of their faces on Sundays; #MotivationMonday, in which users post motivational photos on Mondays; #TransformationTuesday, in which users post photos highlighting differences from the past to the present; #WomanCrushWednesday, in which users post photos of women they have a romantic interest in or view favorably, as well as its #ManCrushMonday counterpart centered on men; and #ThrowbackThursday, in which users post a photo from their past, highlighting a particular moment.[269][270]In December 2017, The Verge reported that Instagram would let users press \"Follow\" on a hashtag, thereby seeing relevant highlights of the topic in their feeds.[271][272]Motives among young adultsThe motives for using Instagram among young people are mainly to look at posts, particularly for the sake of social interactions and recreation. In contrast, the level of agreement expressed in creating Instagram posts was lower, which demonstrates that Instagram's emphasis on visual communication is widely accepted by young people in social communication.[273]Columbia Law School professor Tim Wu has given public talks explaining that Facebook's 2012 purchase of Instagram was a felony.[274] A New York Post article published on February 26, 2019, reported that \"the FTC had uncovered [a document] by a high-ranking Facebook executive who said the reason the company was buying Instagram was to eliminate a potential competitor\".[275] As Wu explains, this is a violation of US antitrust law (see monopoly). Wu stated that this document was an email directly from Mark Zuckerberg, whereas the Post article had stated that their source had declined to say whether the high-ranking executive was the CEO. The article reported that the FTC \"has formed a task force to review “anticompetitive conduct” in the tech world amid concerns that tech companies are growing too powerful. The task force will look at “the full panoply of remedies” if it finds “competitive harm,” FTC competition bureau director Bruce Hoffman told reporters.\"On December 17, 2012, Instagram announced a change to its Terms of Service policy, adding the following sentence:[276]To help us deliver interesting paid or sponsored content or promotions, you agree that a business or other entity may pay us to display your username, likeness, photos (along with any associated metadata), and/or actions you take, in connection with paid or sponsored content or promotions, without any compensation to you.There was no option for users to opt out of the changed Terms of Service without deleting their accounts before the new policy went into effect on January 16, 2013.[277] The move garnered severe criticism from users,[278][279][280] prompting Instagram CEO Kevin Systrom to write a blog post one day later, announcing that they would \"remove\" the offending language from the policy. Citing misinterpretations about its intention to \"communicate that we'd like to experiment with innovative advertising that feels appropriate on Instagram\", Systrom also stated that it was \"our mistake that this language is confusing\" and that \"it is not our intention to sell your photos\". Furthermore, he wrote that they would work on \"updated language in the terms to make sure this is clear\".[281][278]The policy change and its backlash caused competing photo services to use the opportunity to \"try to lure users away\" by promoting their privacy-friendly services,[282] and some services experienced substantial gains in momentum and user growth following the news.[283] On December 20, Instagram announced that the advertising section of the policy would be reverted to its original October 2010 version.[279][284] The Verge wrote about that policy as well, however, noting that the original policy gives the company right to \"place such advertising and promotions on the Instagram Services or on, about, or in conjunction with your Content\", meaning that \"Instagram has always had the right to use your photos in ads, almost any way it wants. We could have had the exact same freakout last week, or a year ago, or the day Instagram launched\".[276]The policy update also introduced an arbitration clause, which remained even after the language pertaining to advertising and user content had been modified.[285]Instagram has been the subject of criticism due to users publishing images of drugs they are selling on the platform. In 2013, the BBC discovered that users, mostly located in the United States, were posting images of drugs they were selling, attaching specific hashtags, and then completing transactions via instant messaging applications such as WhatsApp. Corresponding hashtags have been blocked as part of the company's response and a spokesperson engaged with the BBC explained:[286][287]Instagram has a clear set of rules about what is and isn't allowed on the site. We encourage people who come across illegal or inappropriate content to report it to us using the built-in reporting tools next to every photo, video or comment, so we can take action. People can't buy things on Instagram, we are simply a place where people share photos and videos.However, new incidents of illegal drug trade have occurred in the aftermath of the 2013 revelation, with Facebook, Instagram's parent company, asking users who come across such content to report the material, at which time a \"dedicated team\" reviews the information.[288]In October 2013, Instagram deleted the account of Canadian photographer Petra Collins after she posted a photo of herself in which a very small area of pubic hair was visible above the top of her bikini bottom. Collins claimed that the account deletion was unfounded because it did not break any of Instagram's terms and conditions.[289] Audra Schroeder of The Daily Dot further wrote that \"Instagram's terms of use state users can't post \"pornographic or sexually suggestive photos,\" but who actually gets to decide that? You can indeed find more sexually suggestive photos on the site than Collins', where women show the side of \"femininity\" the world is \"used to\" seeing and accepting.\"[290] Nick Drewe of The Daily Beast wrote a report the same month focusing on hashtags that users are unable to search for, including #sex, #bubblebutt, and #ballsack, despite allowing #faketits, #gunsforsale and #sexytimes, calling the discrepancy \"nonsensical and inconsistent\".[291]Similar incidents occurred in January 2015, when Instagram deleted Australian fashion agency Sticks and Stones Agency's account because of a photograph including pubic hair sticking out of bikini bottoms,[292] and March 2015, when artist and poet Rupi Kaur's photos of menstrual blood on clothing were removed, prompting a rallying post on her Facebook and Tumblr accounts with the text \"We will not be censored\", gaining over 11,000 shares.[293]The incidents have led to a #FreetheNipple campaign, aimed at challenging Instagram's removal of photos displaying women's nipples. Although Instagram has not made many comments on the campaign,[294] an October 2015 explanation from CEO Kevin Systrom highlighted Apple's content guidelines for apps published through its App Store, including Instagram, in which apps must designate the appropriate age ranking for users, with the app's current rating being 12+ years of age. However, this statement has also been called into question due to other apps with more explicit content allowed on the store, the lack of consequences for men exposing their bodies on Instagram, and for inconsistent treatment of what constitutes inappropriate exposure of the female body.[295][296]In April 2016, Instagram began rolling out a change to the order of photos visible in a user's timeline, shifting from a strictly chronological order to one determined by an algorithm.[297] Instagram said the algorithm was designed so that users would see more of the photos by users that they liked,[67] but there was significant negative feedback, with many users asking their followers to turn on post notifications in order to make sure they see updates.[298][299][300] The company wrote a tweet to users upset at the prospect of the change, but did not back down,[301] nor provide a way to change it back.[302]In response to abusive and negative comments on users' photos, Instagram has made efforts to give users more control over their posts and accompanying comments field. In July 2016, it announced that users would be able to turn off comments for their posts, as well as control the language used in comments by inputting words they consider offensive, which will ban applicable comments from showing up.[303][304] After the July 2016 announcement, the ability to ban specific words began rolling out early August to celebrities,[305] followed by regular users in September.[306] In December, the company began rolling out the abilities for users to turn off the comments and, for private accounts, remove followers.[307][308]In September 2017, the company announced that public users would be able to limit who can comment on their content, such as only their followers or people they follow. At the same time, it updated its automated comment filter to support additional languages.[309][310]In June 2017, Instagram announced that it had introduced a new comment moderation system, that will automatically attempt to filter offensive, harassing, and \"spammy\" comments by default. The system is built using a Facebook-developed deep learning algorithm known as DeepText (first implemented on the social network to detect spam comments), which utilizes natural-language processing techniques, and can also filter by user-specified keywords.[311][312][313]In May 2017, a survey conducted by United Kingdom's Royal Society for Public Health, featuring 1,479 people aged 14–24, asking them to rate social media platforms depending on anxiety, depression, loneliness, bullying and body image, concluded that Instagram was \"worst for young mental health\". Some have suggested it may contribute to digital dependence, whist this same survey noticed its positive effects, including self expression, self identity, and community building. In response to the survey, Instagram stated that \"Keeping Instagram a safe and supportive place for young people was a top priority\".[314][315] The company will filter out the reviews accounts. If some of the accounts violate Instagram's community guidelines, it will take action, which could include banning them.[316]In 2017, researchers from Harvard University and University of Vermont demonstrated a machine-learning tool that successfully outperformed general practitioners' diagnostic success rate for depression. The tool used color analysis, metadata components, and face-detection of users' feeds.[317]In May 2019, Instagram began testing in Canada a change in post information displays that will hide the number of likes and views photos and videos receive in an effort to create a \"less pressurized\" environment.[318] On July 17, 2019 also began to be tested in Ireland, Italy, Brazil, Australia, New Zealand and Japan.[319][320]In mid-2017, reports surfaced that Instagram had begun efforts to reduce the prominence of accounts using many irrelevant hashtags to increase their respective reach on the social network and users who pay money to a service in order to receive a high amount of post engagement. Known as \"shadowbanning\", the effort hides applicable accounts from appearing in search results and in the app's Explore section. In a now-deleted Facebook post, Instagram wrote that \"When developing content, we recommend focusing on your business objective or goal rather than hashtags\".[321][322]In 2016, Olivia Solon, a reporter for The Guardian, posted a screenshot to her Instagram profile of an email she had received containing threats of rape and murder towards her. The photo post had received three likes and countless comments, and in September 2017, the company's algorithms turned the photo into an advertisement visible to Solon's sister. An Instagram spokesperson apologized and told The Guardian that \"We are sorry this happened – it's not the experience we want someone to have. This notification post was surfaced as part of an effort to encourage engagement on Instagram. Posts are generally received by a small percentage of a person's Facebook friends\". As noted by the technology media, the incident occurred at the same time parent company Facebook was under scrutiny for its algorithms and advertising campaigns being used for offensive and negative purposes.[323][324]In August 2017, reports surfaced that a bug in Instagram's developer tools had allowed \"one or more individuals\" to gain access to the contact information, specifically email addresses and phone numbers, of several high-profile verified accounts, including its most followed user, Selena Gomez. The company said in a statement that it had \"fixed the bug swiftly\" and was running an investigation.[325][326] However, the following month, more details emerged, with a group of hackers selling contact information online, with the affected number of accounts in the \"millions\" rather than the previously-assumed limitation on verified accounts. Hours after the hack, a searchable database was posted online, charging $10 per search.[327] The Daily Beast was provided with a sample of the affected accounts, and could confirm that, while many of the email addresses could be found with a Google search in public sources, some did not return relevant Google search results and thus were from private sources.[328] The Verge wrote that cybersecurity firm RepKnight had found contact information for multiple actors, musicians, and athletes,[327] and singer Selena Gomez's account was used by the hackers to post naked photos of her ex-boyfriend Justin Bieber. The company admitted that \"we cannot determine which specific accounts may have been impacted\", but believed that \"it was a low percentage of Instagram accounts\", though TechCrunch stated in its report that six million accounts were affected by the hack, and that \"Instagram services more than 700 million accounts; six million is not a small number\".[329]Instagram caused the userbase to fall into outrage, with the December 2018 update.[330][331][332][333][334] An attempt to alter the flow of the feed from the traditional vertical scroll to emulate and piggy-back the popularity of their Instagram Stories with a horizontal scroll, swiping left.[335] Various backtracking statements were released explaining it as a bug, or as a test release that had been accidentally deployed to too large an audience.[333][332]Censorship of Instagram has occurred in several different countries.Instagram has been blocked by China following the 2014 Hong Kong protests because a lot of videos and photos are posted. Hong Kong and Macau were not affected as they are special administrative regions of China.[336]Turkey is also known for its strict Internet censorship and periodically blocks social media including Instagram.[337]A few days after a fire incident that happened in the Koryo Hotel in North Korea in June 11, 2015, authorities began to block Instagram to prevent photos of the incident being spread out.[338]Instagram was the runner-up for \"Best Mobile App\" at the 2010 TechCrunch Crunchies in January 2011.[339] In May 2011, Fast Company listed CEO Kevin Systrom at number 66 in \"The 100 Most Creative People in Business in 2011\".[340] In June 2011, Inc. included co-founders Systrom and Krieger in its 2011 \"30 Under 30\" list.[341]Instagram won \"Best Locally Made App\" in the SF Weekly Web Awards in September 2011.[342] 7x7Magazine's September 2011 issue featured Systrom and Krieger on the cover of their \"The Hot 20 2011\" issue.[343] In December 2011, Apple Inc. named Instagram the \"App of the Year\" for 2011.[344] In 2015, Instagram was named No. 1 by Mashable on its list of \"The 100 best iPhone apps of all time,\" noting Instagram as \"one of the most influential social networks in the world.\"[345]"
    },
    {
        "name": "Facebook Watch",
        "text": "Facebook Watch is a video-on-demand service operated by Facebook, Inc. It was announced on August 9, 2017, with initial availability the next day and with rollout to all U.S. users by the end of the month. Facebook Watch's original video content is produced for the company by partners, who earn 55% of advertising revenue (Facebook keeps 45%).Facebook Watch offers personalized recommendations for videos to watch, as well as categorized content bundles depending on factors such as popularity and social media engagement. Facebook wants both short-form and long-form entertainment on its platform, and has a reported total of $1 billion in budget for content through 2018. Facebook monetizes videos through mid-roll advertising breaks and plans to test pre-roll advertising in 2018. On August 30, 2018, Facebook Watch became available internationally to all users of the social network worldwide.As of June 2019, Facebook reported that 140 million people per day spent at least one minute in Watch, and 720 million viewers per month.[1]On August 9, 2017, Facebook Inc. announced that it would be launching its own video on demand service. During the same announcement it was stated that the new service would be called Facebook Watch. The video on demand service was launched for a small group of U.S. users a day later,[2][3] with a rollout to all U.S. users beginning at the end of August.[4]In May and June 2018, Facebook launched around six news programs from partners including BuzzFeed, Vox, CNN, and Fox News. These programs, developed by Facebook's head of news partnerships Campbell Brown, reportedly had an overall budget of US$90 million.[5]On July 25, 2018, Facebook gave their first presentation ever at the annual Television Critics Association's annual summer press tour. During Facebook's allotted time, Fidji Simo, the Vice President of Product for Video, and Ricky Van Veen, the Head of Global Creative Strategy, showcased Facebook's continuing ramp-up of original programming on Facebook Watch.[6] On August 30, 2018, Facebook Watch became available internationally to all users of the social network worldwide.[7]For short-form videos, Facebook originally had a budget of roughly $10,000-$40,000 per episode,[8] though renewal contracts have placed the budget in the $50,000-$70,000 range.[9] Long-form TV-length series have budgets between $250,000 to over $1 million.[9] The Wall Street Journal reported in September 2017 that the company was willing to spend up to $1 billion on original video content through 2018.[10][11]Facebook keeps 45% of ad-break revenue for content shown on Facebook Watch, while its content-producing partners receive 55% of ad revenue.[2] In January 2017, the company announced that it would be adding \"mid-roll\" advertising to its videos, in which ads will appear in videos after users have watched at least 20 seconds.[12] In December 2017, Ad Age reported that Facebook was lifting a long-time ban on \"pre-roll\" ads, an advertising format that shows promotional content before users start the actual video. Facebook had resisted using pre-roll ads because the format has a \"reputation for annoying viewers\" who want to get to the desired content, though the report stated that the company would nevertheless try the format.Steve Ellis, CEO of WhoSay, a social influencer marketing company, told Ad Age that \"YouTube already established that people will sit through and tolerate pre-roll\" and that \"It's proven that they haven't sent consumers fleeing, so it makes sense that Facebook would pursue a similar strategy as it builds out its original content experience\".[13] Two weeks after Ad Age's report, Facebook updated its blog to note that the pre-roll advertising format would begin testing in 2018, and that there were going to be changes to mid-roll ads; specifically, they cannot appear until a minute into a video, and are only available for videos that run for at least three minutes, as opposed to the original rule of appearing after 20 seconds on videos potentially as short as 90 seconds.[14][15]In addition to original programming, Facebook Watch also distributes content licensed from other companies. On November 30, 2018, it was announced that the streaming service had struck a deal with 20th Century Fox Television to stream television series Buffy the Vampire Slayer, Angel, and Firefly.[16]Morgan Stanley analyst Brian Nowak estimates that \"Facebook Watch\" can bring in $565 million in revenue to Facebook by the end of 2018.[17] Jefferies analyst Brent Thill has predicted that the service has the potential to earn $12 billion in revenue by 2022.[18]"
    },
    {
        "name": "WhatsApp Messenger",
        "text": "WhatsApp Messenger is a freeware, cross-platform messaging and Voice over IP (VoIP) service owned by Facebook, Inc.[43] It allows users to send text messages and voice messages,[44] make voice and video calls, and share images, documents, user locations, and other media.[45][46] WhatsApp's client application runs on mobile devices but is also accessible from desktop computers, as long as the user's mobile device remains connected to the Internet while they use the desktop app.[47] The service requires users to provide a standard cellular mobile number for registering with the service.[48] In January 2018, WhatsApp released a standalone business app targeted at small business owners, called WhatsApp Business, to allow companies to communicate with customers who use the standard WhatsApp client.[49][50]The client application was created by WhatsApp Inc. of Mountain View, California, which was acquired by Facebook in February 2014 for approximately US$ 19.3 billion.[51][52] It became the world's most popular messaging application by 2015,[53][54] and has over 1.5 billion users worldwide as of February 2018.[55][53] It has become the primary means of communication in multiple countries and locations, including Latin America, India, Pakistan and large parts of Europe, including the United Kingdom, Spain, and France.[53]WhatsApp was founded in 2009 by Brian Acton and Jan Koum, former employees of Yahoo!. After leaving Yahoo! in September 2007, they took some time off in South America.[10] At one point, they applied for jobs at Facebook but were rejected.[10]In January 2009, after purchasing an iPhone and realizing the potential of the app industry on the App Store, Koum and Acton began visiting Koum's friend Alex Fishman in West San Jose to discuss a new type of messaging app that would \"[show] statuses next to individual names of the people\". They realized that to take the idea further, they'd need an iPhone developer. Fishman visited RentACoder.com, found Russian developer Igor Solomennikov, and introduced him to Koum.Koum named the app WhatsApp to sound like \"what's up\". On February 24, 2009, he incorporated WhatsApp Inc. in California. However, when early versions of WhatsApp kept crashing, Koum considered giving up and looking for a new job. Acton encouraged him to wait for a \"few more months\".[56]In June 2009, Apple launched push notifications, allowing users to be pinged when they were not using an app. Koum changed WhatsApp so that when a user's status is changed, everyone in the user's network would be notified.[10] WhatsApp 2.0 was released with a messaging component and the number of active users suddenly increased to 250,000. Although Acton was managing another startup, he decided to join the company.[10] In October 2009, Acton persuaded five former friends at Yahoo! to invest $250,000 in seed funding, and Acton became a co-founder and was given a stake. He officially joined WhatsApp on November 1.[10] After months at beta stage, the application launched in November 2009, exclusively on the App Store for the iPhone. Koum then hired a friend in Los Angeles, Chris Peiffer, to develop a BlackBerry version, which arrived two months later.[10]To cover the primary cost of sending verification texts to users, WhatsApp was changed from a free service to a paid one. In December 2009, the ability to send photos was added to the iPhone version. By early 2011, WhatsApp was one of the top 20 apps at Apple's U.S. App Store.[10]In April 2011, Sequoia Capital invested about $8 million for more than 15% of the company, after months of negotiation with Sequoia partner Jim Goetz.[57][58][59]By February 2013, WhatsApp had about 200 million active users and 50 staff members. Sequoia invested another $50 million, and WhatsApp was valued at $1.5 billion.[10]In a December 2013 blog post, WhatsApp claimed that 400 million active users used the service each month.[60]On February 19, 2014, months after a venture capital financing round at a $1.5 billion valuation,[61] Facebook, Inc. announced it was acquiring WhatsApp for US$19 billion, its largest acquisition to date.[52] At the time, it was the largest acquisition of a venture-backed company in history.[51] Sequoia Capital received an approximate 5000% return on its initial investment.[62] Facebook, which was advised by Allen & Co, paid $4 billion in cash, $12 billion in Facebook shares, and (advised by Morgan Stanley) an additional $3 billion in restricted stock units granted to WhatsApp's founders Koum and Acton.[63] Employee stock was scheduled to vest over four years subsequent to closing.[52] Days after the announcement, WhatsApp users experienced a loss of service, leading to anger across social media.[64]The acquisition caused a considerable number of users to try and/or move to other message services. Telegram claimed that it acquired 8 million new users;[65] and Line, 2 million.[66]At a keynote presentation at the Mobile World Congress in Barcelona in February 2014, Facebook CEO Mark Zuckerberg said that Facebook's acquisition of WhatsApp was closely related to the Internet.org vision.[67][68] A TechCrunch article said this about Zuckerberg's vision:The idea, he said, is to develop a group of basic internet services that would be free of charge to use – 'a 911 for the internet.' These could be a social networking service like Facebook, a messaging service, maybe search and other things like weather. Providing a bundle of these free of charge to users will work like a gateway drug of sorts – users who may be able to afford data services and phones these days just don't see the point of why they would pay for those data services. This would give them some context for why they are important, and that will lead them to paying for more services like this – or so the hope goes.[67]Just three days after announcing the Facebook purchase, Koum said they were working to introduce voice calls. He also said that new mobile phones would be sold in Germany with the WhatsApp brand, and that their ultimate goal was to be on all smartphones.[69]In August 2014, WhatsApp was the most globally popular messaging app, with more than 600 million users.[70] By early January 2015, WhatsApp had 700 million monthly users and over 30 billion messages every day.[71] In April 2015, Forbes predicted that between 2012 and 2018, the telecommunications industry would lose $386 billion because of OTT services like WhatsApp and Skype.[72] That month, WhatsApp had over 800 million users.[73][74] By September 2015, it had grown to 900 million;[75] and by February 2016, one billion.[76]In November 30, 2015, the Android WhatsApp client made links to another message service, Telegram, unclickable and uncopyable.[77][78][79] Multiple sources confirmed that it was intentional, not a bug,[79] and that it had been implemented when the Android source code that recognized Telegram URLs had been identified.[79] (The word \"telegram\" appeared in WhatsApp's code.[79]) Some considered it an anti-competitive measure,[77][78][79] but WhatsApp offered no explanation.On January 18, 2016, WhatsApp's co-founder Jan Koum announced that it would no longer charge users a $1 annual subscription fee, in an effort to remove a barrier faced by users without credit cards.[80][81] He also said that the app would not display any third-party ads, and that it would have new features such as the ability to communicate with businesses.[76][82]By June 2016, the company's blog reported more than 100 million voice calls per day were being placed on WhatsApp.[83]On November 10, 2016, WhatsApp launched a beta version of two-step verification for Android users, which allowed them to use their email addresses for further protection.[84] Also in November 2016, Facebook ceased collecting WhatsApp data for advertising in Europe.[85]On February 24, 2017, (WhatsApp's 8th birthday), WhatsApp launched a new Status feature similar to Snapchat and Facebook stories.[86]On May 18, 2017, it was reported that the European Commission would fine Facebook €110 million for \"misleading\" it during the 2014 takeover of WhatsApp. The Commission alleged that in 2014, when Facebook acquired the messaging app, it \"falsely claimed it was technically impossible to automatically combine user information from Facebook and WhatsApp.\" However, in the summer of 2016, WhatsApp had begun sharing user information with its parent company, allowing information such as phone numbers to be used for targeted Facebook advertisements. Facebook acknowledged the breach, but said the errors in their 2014 filings were \"not intentional.\"[85]In September 2017, WhatsApp's co-founder Brian Acton left the company to start a nonprofit group,[87] later revealed as the Signal Foundation, which now develops the WhatsApp competitor Signal.[88] WhatsApp also announced a forthcoming business platform to enable companies to provide customer service at scale,[89] and airlines KLM and Aeroméxico announced their participation in the testing.[90][91][92][93] Both airlines previously launched customer services on the Facebook Messenger platform.In January 2018, WhatsApp launched WhatsApp Business for small business use.[94]In April 2018, WhatsApp co-founder and CEO Jan Koum announced he would be leaving the company.[95] Facebook later announced that Koum's replacement would be Chris Daniels.[8]Later in September 2018, WhatsApp introduced group audio and video call features.[96][97] In October, the \"Swipe to Reply\" option was added to the Android beta version, 16 months after it was introduced for iOS.[98]25 November 2019 WhatsApp announced an investment of $250,000 into the startup ecosystem through a partnership with Startup India, where it will provide 500 startups with Facebook ad credits of $500 each. [99]In May 2019, WhatsApp was attacked by hackers who installed spyware on a number of victims' smartphones.[100] The hack, allegedly developed by Israeli surveillance technology firm NSO Group, injected malware onto WhatsApp users’ phones via a remote-exploit bug in the app's Voice over IP calling functions. A Wired report noted the attack was able to inject malware via calls to the targeted phone, even if the user did not answer the call.[101] On October 29, WhatsApp filed a lawsuit against NSO Group in a San Francisco court, claiming that the alleged cyberattack violated US laws including the Computer Fraud and Abuse Act (CFAA).[102] According to WhatsApp, the exploit \"targeted at least 100 human-rights defenders, journalists and other members of civil society\" among a total of 1,400 users in 20 countries.[103][104][105]Until 2017, WhatsApp was for individual use between two smartphones. This enabled businesses to communicate with customers,[106] but not at scale (e.g. in a contact center environment). In September 2017 WhatsApp confirmed rumors[107][108] that they were building and testing two new tools for businesses:[93]After months at beta stage, the official first release of WhatsApp launched in November 2009, exclusively at the App Store for iPhone. In January 2010, support for BlackBerry smartphones was added; and subsequently for Symbian OS in May 2010, and for Android OS in August 2010. In August 2011, a beta for Nokia's non-smartphone OS Series 40 was added. A month later, support for Windows Phone was added, followed by BlackBerry 10 in March 2013.[111] In April 2015, support for Samsung's Tizen OS was added.[112] Unofficial ports, Wazapp and Yappari, have also been released for the MeeGo-based Nokia N9[113] and the Maemo-based Nokia N900, respectively.[114]The oldest device capable of running WhatsApp was the Symbian-based Nokia N95 released in March 2007. (As of June 2017, WhatsApp is no longer compatible with it.)In August 2014, WhatsApp released an Android update, adding support for Android Wear smartwatches.[115]In 2014, an unofficial open source plug-in, whatsapp-purple, was released for Pidgin, implementing its XMPP and making it possible to use WhatsApp on PCs running Microsoft Windows and Linux.[116][third-party source needed] WhatsApp responded by blocking phone numbers that used the plug-in.[citation needed]On January 21, 2015, WhatsApp launched WhatsApp Web, a browser-based web client that could be used by syncing with a mobile device's connection.[117]On February 26, 2016, WhatsApp announced they would cease support for BlackBerry (including BlackBerry 10), Series 40, and Symbian S60, as well as older versions of Android (2.2), Windows Phone (7.0), and iOS (6), by the end of 2016.[118] BlackBerry, Series 40, and Symbian support was then extended to June 30, 2017.[119] In June 2017, support for BlackBerry and Series 40 was once again extended until the end of 2017, while Symbian was dropped.[120]Support for BlackBerry and older (version 8.0) Windows Phone and older (version 6) iOS devices was dropped on January 1, 2018, but was extended to December 2018 for Nokia Series 40.[121] In July 2018, it was announced that WhatsApp would soon be available for KaiOS feature phones.[122][123]In October 2019, WhatsApp officially launched a new fingerprint app-locking feature for Android users.[124]WhatsApp was officially made available for PCs through a web client, under the name WhatsApp Web, in late January 2015 through an announcement made by Koum on his Facebook page: \"Our web client is simply an extension of your phone: the web browser mirrors conversations and messages from your mobile device—this means all of your messages still live on your phone\". The WhatsApp user's handset must still be connected to the Internet for the browser application to function. All major desktop browsers are supported except for Internet Explorer. WhatsApp Web's user interface is based on the default Android one.[citation needed]As of January 21, 2015, the desktop version was only available to Android, BlackBerry, and Windows Phone users. Later on, it also added support for iOS, Nokia Series 40, and Nokia S60 (Symbian).[125][126]An unofficial derivative called WhatsAppTime has been developed, which is a standard Win32 application for PCs and supports notifications through the Windows notification area.[127]There are similar solutions for macOS, such as the open-source ChitChat.[128][129][130]On May 10, 2016, the messaging service was introduced for both Microsoft Windows and macOS operating systems. WhatsApp currently does not allow audio or video calling from desktop operating systems. Similar to the WhatsApp Web format, the app, which will be synced with a user's mobile device, is available for download on the website. It supports OS versions of Windows 8 and OS X 10.9 and higher.[131][132]WhatsApp uses a customized version of the open standard Extensible Messaging and Presence Protocol (XMPP).[133] Upon installation, it creates a user account using one's phone number as the username (Jabber ID: [phone number]@s.whatsapp.net).WhatsApp software automatically compares all the phone numbers from the device's address book with its central database of WhatsApp users to automatically add contacts to the user's WhatsApp contact list. Previously the Android and Nokia Series 40 versions used an MD5-hashed, reversed-version of the phone's IMEI as password,[134] while the iOS version used the phone's Wi-Fi MAC address instead of IMEI.[135][136] A 2012 update now generates a random password on the server side.[137]Some Dual SIM devices may not be compatible with WhatsApp, though there are some workarounds for this.[138]In February 2015, WhatsApp introduced a voice calling feature; this helped WhatsApp to attract a completely different segment of the user population.[139][140] WhatsApp's voice codec is Opus,[141][142][143] which uses the modified discrete cosine transform (MDCT) and linear predictive coding (LPC) audio compression algorithms.[144] WhatsApp uses Opus at 8–16 kHz sampling rates.[141][143] On November 14, 2016, Whatsapp added a video calling feature for users across Android, iPhone, and Windows Phone devices.[145][146]On November 2017, Whatsapp released a new feature that would let its users delete messages sent by mistake within a time frame of 7 minutes.[147]Multimedia messages are sent by uploading the image, audio or video to be sent to an HTTP server and then sending a link to the content along with its Base64 encoded thumbnail (if applicable).[148]WhatsApp follows a \"store and forward\" mechanism for exchanging messages between two users. When a user sends a message, it first travels to the WhatsApp server where it is stored. Then the server repeatedly requests the receiver acknowledge receipt of the message. As soon as the message is acknowledged, the server drops the message; it is no longer available in the database of the server. The WhatsApp server keeps the message only for 30 days in its database when it is not delivered (when the receiver is not active on WhatsApp for 30 days).[149][self-published source?]On November 18, 2014, Open Whisper Systems announced a partnership with WhatsApp to provide end-to-end encryption by incorporating the encryption protocol used in Signal into each WhatsApp client platform.[150] Open Whisper Systems said that they had already incorporated the protocol into the latest WhatsApp client for Android, and that support for other clients, group/media messages, and key verification would be coming soon after.[151] WhatsApp confirmed the partnership to reporters, but there was no announcement or documentation about the encryption feature on the official website, and further requests for comment were declined.[152] In April 2015, German magazine Heise Security used ARP spoofing to confirm that the protocol had been implemented for Android-to-Android messages, and that WhatsApp messages from or to iPhones running iOS were still not end-to-end encrypted.[153] They expressed the concern that regular WhatsApp users still could not tell the difference between end-to-end encrypted messages and regular messages.[153] On April 5, 2016, WhatsApp and Open Whisper Systems announced that they had finished adding end-to-end encryption to \"every form of communication\" on WhatsApp, and that users could now verify each other's keys.[37][154] Users were also given the option to enable a trust on first use mechanism in order to be notified if a correspondent's key changes.[155] According to a white paper that was released along with the announcement, WhatsApp messages are encrypted with the Signal Protocol.[156] WhatsApp calls are encrypted with SRTP, and all client-server communications are \"layered within a separate encrypted channel\".[156] The Signal Protocol library used by WhatsApp is open-source and published under the GPLv3 license.[156][157]Cade Metz, writing in Wired, said, \"WhatsApp, more than any company before it, has taken encryption to the masses.\"[43]WhatsApp Payments is a peer-to-peer money transfer feature that is currently only available in India. WhatsApp has received permission from the National Payments Corporation of India (NPCI) to enter into partnership with multiple banks in July 2017[158] to allow users to make in-app payments and money transfers using the Unified Payments Interface (UPI).[159] UPI enables account-to-account transfers from a mobile app without having any details of the beneficiary's bank.[160] This feature is being pilot tested with over a million users since April 2019, however there has not been any update on the final roll out.[161]On February 28, 2019, The New York Times reported that Facebook was “hoping to succeed where Bitcoin failed” by developing an in-house cryptocurrency that would be incorporated into WhatsApp. The project reportedly involves over 50 engineers under the direction of former PayPal president David Marcus. This 'Facebook coin' will reportedly be a stablecoin pegged to the value of a basket of different foreign currencies.[162]In July 2018, WhatsApp encouraged people to report fraudulent or inciting messages after lynch mobs in India murdered innocent people because of malicious WhatsApp messages falsely accusing the victims of intending to abduct children.[163]In an investigation on the use of social media in politics, it was found that WhatsApp was being abused for the spread of fake news in the 2018 presidential elections in Brazil.[164] Furthermore, it has been reported that US$3 million has been spent in illegal off-the-books contributions related to this practice.[165]Researchers and journalists have called on WhatsApp parent company, Facebook, to adopt measures similar to those adopted in India and restrict the spread of hoaxes and fake news.[164]WhatsApp was initially criticized for its lack of encryption, sending information as plaintext.[166] Encryption was first added in May 2012.[167][168][169]In 2016, WhatsApp was widely praised for the addition of end-to-end encryption and earned a 6 out of 7 points on the Electronic Frontier Foundation's \"Secure Messaging Scorecard.\"[170] WhatsApp was criticized by security researchers and the Electronic Frontier Foundation for using backups that are not covered by end-to-end encryption and allow messages to be accessed by third-parties.[171][172]In May 2019, a security vulnerability in WhatsApp was found and fixed that allowed a remote person to install spyware by making a call which did not need to be answered.[173][174]In September 2019, WhatsApp was criticized for its implementation of a 'delete for everyone' feature. iOS users can elect to save media to their camera roll automatically. When a user deletes media for everyone, WhatsApp does not delete images saved in the iOS camera roll and so those users are able to keep the images. WhatsApp released a statement saying that \"the feature is working properly,\" and that images stored in the camera roll cannot be deleted due to Apple's security layers.[175]In November 2019, WhatsApp released a new privacy feature that let users decide who adds them to the group.[176]NHSIn 2018 it was reported that around 500,000 NHS staff used WhatsApp and other instant messaging systems at work and around 29,000 had faced disciplinary action for doing so. Higher usage was reported by frontline clinical staff to keep up with care needs, even though NHS trust policies do not permit their use.[177]Mods and Fake versionsIn March 2019, WhatsApp released a guide for users that had installed unofficial modified versions of WhatsApp and warned against data loss in case users persisted in using the same as it considered banning such users.[178]NSO GroupIn October 2019, WhatsApp launched an unprecedented lawsuit against an Israeli surveillance firm NSO Group, accusing that it was behind the highly sophisticated cyber attacks on over 100 human rights activists, journalists, lawyers and academics. WhatsApp also claimed that the firm violated American law in an “unmistakable pattern of abuse”.[179]In December 2015, it was reported that Islamic State terrorists had been using WhatsApp to plot the November 2015 Paris attacks.[180] ISIS also uses WhatsApp to traffic sex slaves.[181]In March 2017, U.K. Secretary of State Amber Rudd said encryption capabilities of messaging tools like WhatsApp are unacceptable, as news reported that Khalid Masood used the application several minutes before perpetrating the 2017 Westminster attack. Rudd publicly called for police and intelligence agencies to be given access to WhatsApp and other encrypted messaging services to prevent future terror attacks.[182]In April 2017, the perpetrator of the Stockholm attack reportedly used WhatsApp to exchange messages with an ISIS supporter shortly before and after the 2017 Stockholm attack. The messages involved discussing how to make an explosive device and a confession of the perpetration after the attack.[183]It has been asserted that WhatsApp is plagued by scams that invite hackers to spread malicious viruses or malware.[184][185] In May 2016, some WhatsApp users were reported to have been tricked into downloading a third-party application called WhatsApp Gold, which was part of a scam that infected the users' phones with malware.[186] A message that promises to allow access to their WhatsApp friends' conversations, or their contact lists, has become the most popular hit against anyone who uses the application in Brazil. Since December 2016, more than 1.5 million people have clicked and lost money.[187]Another application called GB Whatsapp is considered malicious by cybersecurity firm Symantec because it usually performs some unauthorized operations on end-user devices.[188]WhatsApp is owned by Facebook, whose main social media service has been blocked in China since 2009.[189] In September 2017, security researchers reported to The New York Times that the WhatsApp service had been completely blocked in China.[190]According to Time, Sarsenbek Akaruli, 45, a veterinarian and trader from Ili, Xinjiang, was arrested in Xinjiang on Nov. 2, 2017. As of November 2019, he is still in a detention camp. According to his wife Gulnur Kosdaulet, Akaruli was put in the camp after police found the banned messaging app WhatsApp on his cell phone. Kosdaulet, a citizen of neighboring Kazakhstan, has traveled to Xinjiang on four occasions to search for her husband but could not get help from friends in the Communist Party of China. Kosdaulet said of her friends, \"Nobody wanted to risk being recorded on security cameras talking to me in case they ended up in the camps themselves.\"[191]On May 9, 2014, the government of Iran announced that it had proposed to block the access to WhatsApp service to Iranian residents. \"The reason for this is the assumption of WhatsApp by the Facebook founder Mark Zuckerberg, who is an American Zionist,\" said Abdolsamad Khorramabadi, head of the country's Committee on Internet Crimes. Subsequently, Iranian president Hassan Rouhani issued an order to the Ministry of ICT to stop filtering WhatsApp.[192][193]Turkey temporarily banned WhatsApp in 2016, following the assassination of the Russian ambassador to Turkey.[194]On March 1, 2016, Diego Dzodan, Facebook's vice-president for Latin America was arrested in Brazil for not cooperating with an investigation in which WhatsApp conversations were requested.[195] On March 2, 2016, at dawn the next day, Dzodan was released because the Court of Appeal held that the arrest was disproportionate and unreasonable.[196]On May 2, 2016, mobile providers in Brazil were ordered to block WhatsApp for 72 hours for the service's second failure to cooperate with criminal court orders.[197][198] Once again, the block was lifted following an appeal, after nearly 24 hours.[199]WhatsApp, one of the most activated messaging apps along with other social media networks such as Facebook and Instagram were temporarily blocked, banned and had been unavailable for about two days (March 7–8, 2018) in certain parts of the country to eradicate communal violence, especially the anti-Muslim riots.[200] This was probably the first such instance where social media platforms had been banned in Sri Lanka. The ban was finally lifted on March 14, 2018 around midnight time in Sri Lanka.[201]The government of Uganda banned WhatsApp and Facebook, along with other social media platforms, to enforce a tax on the use of social media.[202] Users are to be charged 200 shilling per day to access these services according to the new law set by parliament.[203]WhatsApp handled ten billion messages per day in August 2012,[204] growing from two billion in April 2012,[205] and one billion the previous October.[206] On June 13, 2013, WhatsApp announced that they had reached their new daily record by processing 27 billion messages.[207] According to the Financial Times, WhatsApp \"has done to SMS on mobile phones what Skype did to international calling on landlines.\"[208]As of April 22, 2014, WhatsApp had over 500 million monthly active users, 700 million photos and 100 million videos were being shared daily, and the messaging system was handling more than 10 billion messages each day.[209][210]On August 24, 2014, Koum announced on his Twitter account that WhatsApp had over 600 million active users worldwide. At that point WhatsApp was adding about 25 million new users every month, or 833,000 active users per day.[70][211] With 65 million active users representing 10% of the total worldwide users, India has the largest number of consumers.[212]In May 2017, it was reported that WhatsApp users spend over 340 million minutes on video calls each day on the app. This is the equivalent of roughly 646 years of video calls per day.[213]As of February 2017, WhatsApp had over 1.2 billion users globally,[214] reaching 1.5 billion monthly active users by the end of 2017.[215]India is by far WhatsApp's largest market in terms of total number of users. In May 2014, WhatsApp crossed 50 million monthly active users in India, which is also its largest country by the number of monthly active users,[216] then 70 million in October 2014, making users in India 10% of WhatsApp's total user base.[217] In February 2017, WhatsApp reached 200 million monthly active users in India.[218]Israel is one of WhatsApp's strongest markets in terms of ubiquitous usage. According to Globes, already by 2013 the application was installed on 92% of all smartphones, with 86% of users reporting daily use.[219] WhatsApp's group chat feature is reportedly used by many Israeli families to stay in contact with each other.[220]WhatsApp competes with a number of messaging services. Those, as of 2019, were services like iMessage (estimated 1.3 billion active users[221]), WeChat (1 billion active users[222]), Viber (260 million active users[223]), Telegram (200 million users[224]) and LINE (187 million active users[225]). Telegram in particular was reported to get registration spikes during WhatsApp outages and controversies.[226][227][228]WhatsApp has increasingly drawn its innovation from competing services,[229] such as a Telegram-inspired web version[230] and features for groups.[231] In 2016, WhatsApp was accused of copying features from a then-unreleased version of iMessage.[232]Media related to WhatsApp at Wikimedia Commons"
    }
]