[
{"Title": "Fitbit", "Organization_name": "Fitbit, Inc.", "Type": "Public", "Traded as": "NYSE : FIT (Class A) Russell 2000 Component", "ISIN": "US33812L1026", "Industry": "Consumer electronics", "Founded": "March 26, 2007 ; 12 years ago (2007-03-26) (as Healthy Metrics Research, Inc.) Delaware, U.S.", "Founders": "James Park Eric Friedman", "Headquarters": "San Francisco, California", "Area served": "Worldwide", "Key people": "James Park (CEO) Eric Friedman (CTO)", "Products": "See List of Fitbit products", "Parent": "Alphabet Inc.", "Subsidiaries": "Pebble", "Website": "www.fitbit.com", "strings": ["Fitbit, Inc.", "According to an IDC report published on December 3, 2018, Fitbit is considered the third largest wearable company in shipments as of the third quarter of 2018, behind Xiaomi and Apple.", "In those who are overweight or obese, a 2016 study indicates that the use of wearable technology combined with standard behavioral interventions results in less rather than more weight loss after two years of use when compared to usual weight loss interventions.", "Alongside the activity trackers, Fitbit offers a website and mobile app for iOS, Android and Windows 10 Mobile. Users can choose to share their progress pictures and achievement badges.", "The first product released was the Fitbit Tracker.", "The Fitbit Charge 3, a wristwatch-like health and fitness tracker introduced in October 2018, was the first device to feature a oxygen saturation (SPO2) sensor - however, it is non-functional and Fitbit has yet to give a timeline for the feature to be enabled. This is creating significant customer backlash as of January 2019. The device has a touchscreen display, goal-based exercise modes and some smart features.", "The Fitbit Charge 3 comes with two different-sized bands: small and large. The small is around between 5.5 - 7.1 inches and the large is 7.1- 8.7-inches. Additionally, the screen is larger than the Charge 2 by approximately 40%. Fitbit Charge 3 comes in two color combos: a Rose-Gold case with a Blue Grey band and a “Graphite Aluminum” screen case with a Black band.", "On December 17, 2018, Fitbit announced Fitbit OS 3.0 - a version with an extended on-device dashboard, on-device quick logging for weight and water intake, and goal-based exercise mode. The new extended on-device dashboard (FitBit Today) will include more stats and data regarding sleep, water intake and weight.", "The new Fitbit OS 3.0 also includes Fitbit watch versions of fitness-related apps that are popular on platforms like Apple's iPhone and Google's Android.", "Fitbit also announced that ten new partner apps are being added to the Fitbit App Gallery. Couch to 5K, Achu health, MySwimPro, and Genius Wrist are added on December 17, 2018. Charity Miles, FitBark, Gold's Gym, TRX, Mindbody, and Noonlight Emergency Services will be added by early 2019.", "On December 19, 2018, Emirates NBD announced its support of Fitbit Pay, providing services to the app. Emirates NBD is the first bank in the Middle East to offer this service. To enable transactions, customers need to add their credit cards or debit cards to their Fibit accounts. As Fitbit Pay uses NFC to transmit card technology, the users don't have to authenticate via chip or pin.", "On December 20, 2018, Fitbit announced that it is adding a Run Detect feature, enabling auto-pause and auto-stop. Additionally, Fitbit is adding a new birdie goal celebration and New Clock Faces to choose from.", "For Fitbit Smartwatches, a new Exercise API and open sources tools have been added, allowing developers to build apps in a more efficient and faster way.", "Fitbit has also announced that Fitbit apps will offer a more comprehensive view of menstrual cycle data, which can be monitored through the Female Health Tracking trends in the apps. This new feature is expected to be rolled out in early 2019.", "On January 2, 2019, the company announced the release of the Fitbit Charge 3 in India. The product has been made available for all the major retailers both offline and online", "A small 2014 study of eight fit band devices during 69-minute workouts that included 13 different activities found the bands were at best \"reasonably accurate\", with the Fitbit Zip and Fitbit One scoring 10.1% and 10.4% error ratings, respectively.", "A small 2015 study had participants wear multiple devices on their wrists and hips while performing different walking/running speeds on a treadmill. Fitbit devices worn on the hip accurately measured steps taken within 1 step of 100% accuracy. Devices worn on the wrist, however, were off by an average of 11 steps per minute. When measuring the number of calories burned, Fitbit devices worn on the hip underestimated by an average of 6%, while devices worn on the wrist overestimated calories burned by 21%. Authors concluded that both the Fitbit One and Fitbit Flex devices reliably measured step counts and energy expenditure, with hip-based Fitbit devices being more accurate than wrist-based devices.", "A 2019 study found that the Fitbit Charge 2 accurately measures the average heart rate of healthy adults during sleep and that it is most accurate for medium range of heart rate.", "Fitbit, working with the Consumer Protection Safety Commission, recalled the Fitbit Force on February 20, 2014 because some users experienced allergic reactions to the materials used in the product.", "In April 2017, a woman claimed her Flex 2 malfunctioned and caught fire, causing second-degree burns on her arm.", "Headquartered in San Francisco, California, Fitbit was founded on March 26, 2007 by James Park (CEO) and Eric Friedman (CTO). On May 7, 2015, Fitbit announced it had filed for IPO with a NYSE listing.", "In February 2018, Fitbit announced that it would be partnering with Adidas to release an Adidas-branded Fitbit Ionic, which was released on March 19, 2018.", "In August 2018, Blue Cross Blue Shield Association announced a partnership with Fitbit in which BCBS will include Fitbit's wearables and fitness trackers in its Blue365 program.", "On March 5, 2015, Fitbit announced that it had acquired fitness coaching app developer Fitstar for $17.8 million.", "On March 12, 2016, Fitbit acquired smart credit card company Coin, which included key personnel and intellectual property, but excluded any of Coin's hardware products, which stopped being produced around the time of the acquisition. Fitbit shut down the Coin Rewards and Coin Developer Program during the acquisition. Coin said that existing Coin cards will continue to work until the battery runs out and that existing Coin cards will remain under their one-year manufacturer's warranty.", "On December 6, 2016, Fitbit acquired assets from Pebble, including key personnel, as the company decided to stop producing wearable technology. The acquisition excludes Pebble's hardware products.", "On January 10, 2017, Fitbit acquired Romania-based smartwatch startup Vector Watch SRL. Vector said that there will be no new products with the Vector name, but that existing Vector watches will continue to work.", "On February 13, 2018, Fitbit acquired Boston-based software startup Twine Health for an undisclosed amount. A Fitbit spokesperson said that “nearly all” of Twine Health's employees would start working at Fitbit.", "Alphabet Inc. announced its intent to acquire Fitbit for US$2.1 billion on November 1, 2019, pending approvals.", "Fitbit has won numerous awards, including runner-up at TechCrunch50 in 2008", "To set up and use the hardware, one has to create an account with Fitbit and agree to data collection, transfer and privacy rules.", "Starting in June 2011, Fitbit was criticized for its website's default activity-sharing settings, which made users' manually-entered physical activities available for public viewing.", "The company's devices have also been used in criminal investigations; in one instance, a rape claim against an unnamed intruder was turned around to a criminal charge for false reports based on data from the claimant's Fitbit.", "The company's proposed sale to Alphabet has resulted in concern that Fitbit user data could be combined with other Google services data or sold for purposes such as targeted advertising. In response, Fitbit stated that user data would not be used or sold for advertising by Google, citing that trustworthiness was \"paramount\" to the company, and that the sale would not change their historic commitment to user privacy and security.", "A Fitbit device played a role in solving a murder.", "On March 10, 2015, a woman fabricated a story in which an intruder appeared in her employer's home she was staying at and raped her. Risley told police that a man had assaulted her around midnight. Police found a Fitbit lying on the floor when they arrived at the scene. Prosecutors used the Fitbit as evidence and data to determine what had occurred. The Fitbit revealed that the woman was active throughout the night, and the Fitbit surveillance analysis demonstrated the woman had not gone to bed like she stated to the police, proving that the woman had lied to the police.", "A Fitbit device played a role in solving another murder in 2018. Anthony Aiello murdered his stepdaughter Karen Navarra while visiting her home and her body was found five days later. Data from her Fitbit fitness tracker showed that her heart rate spiked when Aiello visited her and stopped five minutes before he left. Aiello was arrested in September 2018 on murder charges and was booked into the Santa Clara County Jail."]}
]