[
{"Title": "YouTube", "Organization_name": "YouTube, LLC", "Type of business": "Subsidiary", "Type of site": "Video hosting service", "Founded": "February 14, 2005 ; 14 years ago (2005-02-14)", "Headquarters": "901 Cherry Avenue San Bruno, California, United States", "Coordinates": "37°37′41′′N 122°25′35′′W ﻿ / ﻿ 37.62806°N 122.42639°W ﻿ / 37.62806; -122.42639 Coordinates : 37°37′41′′N 122°25′35′′W ﻿ / ﻿ 37.62806°N 122.42639°W ﻿ / 37.62806; -122.42639", "Area served": "Worldwide (excluding blocked countries)", "Founder(s)": "Chad Hurley, Steve Chen, Jawed Karim", "Key people": "Susan Wojcicki (CEO)", "Industry": "Internet, Video hosting service", "Products": "YouTube Music YouTube TV", "Parent": "Google LLC (2006–present)", "Website": "YouTube.com(seelist of localized domain names)", "Alexa rank": "2 (Global, November 2019 [update])", "Advertising": "Google AdSense", "Registration": "Not required to watch most videos; required for certain tasks such as uploading videos, viewing flagged (18+) videos, creating playlists, liking or disliking videos and posting comments", "Launched": "February 14, 2005 ; 14 years ago (2005-02-14)", "Current status": "Active", "Content license": "Uploader holds copyright (standard license); Creative Commons can be selected.", "Written in": "Python (core/API), C (through CPython) , C++, Java (through Guice platform), Go, JavaScript (UI)", "strings": ["YouTube is an American video-sharing platform headquartered in San Bruno, California. Three former PayPal employees—Chad Hurley, Steve Chen, and Jawed Karim—created the service in February 2005. Google bought the site in November 2006 for US$1.65 billion; YouTube now operates as one of Google's subsidiaries.", "YouTube allows users to upload, view, rate, share, add to playlists, report, comment on videos, and subscribe to other users. It offers a wide variety of user-generated and corporate media videos. Available content includes video clips, TV show clips, music videos, short and documentary films, audio recordings, movie trailers, live streams, and other content such as video blogging, short original videos, and educational videos. Most content on YouTube is uploaded by individuals, but media corporations including CBS, the BBC, Vevo, and Hulu offer some of their material via YouTube as part of the YouTube partnership program. Unregistered users can only watch videos on the site, while registered users are permitted to upload an unlimited number of videos and add comments to videos. Videos deemed potentially inappropriate are available only to registered users affirming themselves to be at least 18 years old.", "YouTube and selected creators earn advertising revenue from Google AdSense, a program which targets ads according to site content and audience. The vast majority of its videos are free to view, but there are exceptions, including subscription-based premium channels, film rentals, as well as YouTube Music and YouTube Premium, subscription services respectively offering premium and ad-free music streaming, and ad-free access to all content, including exclusive content commissioned from notable personalities. As of February 2017[update], there were more than 400 hours of content uploaded to YouTube each minute, and one billion hours of content being watched on YouTube every day. As of August 2018[update], the website is ranked as the second-most popular site in the world, according to Alexa Internet, just behind Google.", "YouTube has faced criticism over aspects of its operations, including its handling of copyrighted content contained within uploaded videos,", "YouTube was founded by Steve Chen, Chad Hurley, and Jawed Karim, who were all early employees of PayPal.", "Karim said the inspiration for YouTube first came from Janet Jackson's role in the 2004 Super Bowl incident, when her breast was exposed during her performance, and later from the 2004 Indian Ocean tsunami. Karim could not easily find video clips of either event online, which led to the idea of a video sharing site.", "According to a story that has often been repeated in the media, Hurley and Chen developed the idea for YouTube during the early months of 2005, after they had experienced difficulty sharing videos that had been shot at a dinner party at Chen's apartment in San Francisco. Karim did not attend the party and denied that it had occurred, but Chen commented that the idea that YouTube was founded after a dinner party \"was probably very strengthened by marketing ideas around creating a story that was very digestible\".", "YouTube began as a venture capital–funded technology startup, primarily from an $11.5 million investment by Sequoia Capital and an $8 million investment from Artis Capital Management between November 2005 and April 2006.", "At the time of the official launch, YouTube did not have much market recognition. The week of YouTube's launch, NBC-Universal's Saturday Night Live ran a skit \"Lazy Sunday\" by The Lonely Island. Unofficial uploads of the skit to YouTube drew in more than five million collective views before they were removed at request of NBC-Universal about two months later, but even their short presence at the site not only helped spread the name of YouTube, but allowed users to see it was not just for video lovers and people who create their own video content, but a means to share other types of videos, such as television clips and music videos.", "In May 2011, 48 hours of new videos were uploaded to the site every minute,", "The choice of the name www.youtube.com led to problems for a similarly named website, www.utube.com. The site's owner, Universal Tube & Rollform Equipment, filed a lawsuit against YouTube in November 2006 after being regularly overloaded by people looking for YouTube. Universal Tube has since changed the name of its website to www.utubeonline.com.", "On October 9, 2006, Google Inc. announced that it had acquired YouTube for $1.65 billion in Google stock,", "In March 2010, YouTube began free streaming of certain content, including 60 cricket matches of the Indian Premier League. According to YouTube, this was the first worldwide free online broadcast of a major sporting event.", "In October 2010, Hurley announced that he would be stepping down as chief executive officer of YouTube to take an advisory role, and that Salar Kamangar would take over as head of the company.", "In December 2011, YouTube launched a new version of the site interface, with the video channels displayed in a central column on the home page, similar to the news feeds of social networking sites.", "In early March 2013, YouTube finalized the transition for all channels to the previously[when?] optional “One Channel Layout”, which removed many customization options and custom background images for consistency, and split up the channel information to different tabs (Home/Feed, Videos Playlists, Discussion, About) rather than one unified page.", "In May 2013, YouTube launched a pilot program for content providers to offer premium, subscription-based channels within the platform.", "In February 2015, YouTube released a secondary mobile app known as YouTube Kids. The app is designed to provide an experience optimized for children. It features a simplified user interface, curated selections of channels featuring age-appropriate content, and parental control features.", "In October 2015, YouTube announced YouTube Red (now YouTube Premium), a new premium service that would offer ad-free access to all content on the platform (succeeding the Music Key service released the previous year), premium original series and films produced by YouTube personalities, as well as background playback of content on mobile devices. YouTube also released YouTube Music, a third app oriented towards streaming and discovering the music content hosted on the YouTube platform.", "In January 2016, YouTube expanded its headquarters in San Bruno by purchasing an office park for $215 million. The complex has 554,000 square feet of space and can house up to 2,800 employees.", "On August 29, 2017, YouTube officially launched the “polymer” redesign of its user interfaces based on Material Design language as its default, as well a redesigned logo that is built around the service's play button emblem.", "On April 3, 2018, a shooting took place at YouTube's headquarters in San Bruno, California.", "On May 17, 2018, YouTube announced the re-branding of YouTube Red as YouTube Premium (accompanied by a major expansion of the service into Canada and 13 European markets), as well as the upcoming launch of a separate YouTube Music subscription.", "In September 2018, YouTube began to phase out the separate YouTube Gaming website and app, and introduced a new Gaming portal within the main service. YouTube staff argued that the separate platform was causing confusion, and that the integration would allow the features developed for the service (including game-based portals and enhanced discoverability of gaming-related videos and live streaming) to reach a broader audience through the main YouTube website.", "In July 2019, It was announced that YouTube will discontinue support for Nintendo 3DS systems on September 3, 2019. However, owners of New Nintendo 3DS, or New Nintendo 3DS XL, can still access YouTube on the internet browser.", "YouTube primarily uses the VP9 and H.264/MPEG-4 AVC video formats, and the Dynamic Adaptive Streaming over HTTP protocol.[citation needed] YouTube has begun rolling out videos in AV1 format.", "Previously, viewing YouTube videos on a personal computer required the Adobe Flash Player plug-in to be installed in the browser.", "On January 27, 2015, YouTube announced that HTML5 would be the default playback method on supported browsers. YouTube used to employ Adobe Dynamic Streaming for Flash,", "All YouTube users can upload videos up to 15 minutes each in duration. Users who have a good track record of complying with the site's Community Guidelines may be offered the ability to upload videos up to 12 hours in length, as well as live streams, which requires verifying the account, normally through a mobile phone.", "YouTube accepts videos that are uploaded in most container formats, including AVI, MP4, MPEG-PS, QuickTime File Format and FLV. It supports WebM files and also 3GP, allowing videos to be uploaded from mobile phones.", "Videos with progressive scanning or interlaced scanning can be uploaded, but for the best video quality, YouTube suggests interlaced videos be deinterlaced before uploading. All the video formats on YouTube use progressive scanning.", "YouTube originally offered videos at only one quality level, displayed at a resolution of 320×240 pixels using the Sorenson Spark codec (a variant of H.263),", "In June 2014, YouTube began to deploy support for high frame rate videos up to 60 frames per second (as opposed to 30 before), becoming available for user uploads in October. YouTube stated that this would enhance \"motion-intensive\" videos, such as video game footage.", "YouTube videos are available in a range of quality levels. The former names of standard quality (SQ), high quality (HQ), and high definition (HD) have been replaced by numerical values representing the vertical resolution of the video. The default video stream is encoded in the VP9 format with stereo Opus audio; if VP9/WebM is not supported in the browser/device or the browser's user agent reports Windows XP, then H.264/MPEG-4 AVC video with stereo AAC audio is used instead.", "From 2008 to 2017, users could add \"annotations\" to their videos—such as pop-up text messages and hyperlinks. These functions were notably used as the basis for interactive videos, which used hyperlinks to other videos to achieve branching elements. In March 2017, it was announced that the annotations editor had been discontinued and the feature would be sunset, because their use had fallen rapidly, users had found them to be an annoyance, and because they were incompatible with mobile versions of the service. Annotations were removed entirely from all videos on January 15, 2019. YouTube had introduced standardized widgets intended to replace annotations in a cross-platform manner, including \"end screens\" (a customizable array of thumbnails for specified videos displayed near the end of the video) and \"cards\", but they are not backwards compatible with existing annotations, while the removal of annotations will also break all interactive experiences which depended on them.", "YouTube carried out early experiments with live streaming, including a concert by U2 in 2009, and a question-and-answer session with US President Barack Obama in February 2010.", "In May 2013, creation of live streams was opened to verified users with at least 1,000 subscribers; in August of that year the number was reduced to 100 subscribers,", "In a video posted on July 21, 2009, The feature set has since been reduced, and the 3D feature currently only supports red/cyan anaglyph with no side-by-side support.", "In January 2015, Google announced that 360-degree video would be natively supported on YouTube. On March 13, 2015, YouTube enabled 360° videos which can be viewed from Google Cardboard, a virtual reality system. YouTube 360 can also be viewed from all other virtual reality headsets.", "In 2017, YouTube began to promote an alternative stereoscopic video format known as VR180, which is limited to a 180-degree field of view, but is promoted as being easier to produce than 360-degree video, and allowing more depth to be maintained by not subjecting the video to equirectangular projection.", "In late November 2018, YouTube announced that it would introduce a \"Story\" feature, similar to ones used by Snapchat and Instagram, which would allow its content creators to engage fans without posting a full video.", "On September 13, 2016, YouTube launched a public beta of Community, a social media-based feature that allows users to post text, images (including GIFs), live videos and others in a separate \"Community\" tab on their channel.", "After the feature has been officially released, the community post feature gets activated automatically for every channel that passes a specific threshold of subscriber counts or already has more subscribers. This threshold was lowered over time[when?], from 10000 subscribers to 1500 subscribers, to 1000 subscribers, which is the current threshold as of September 2019.", "Channels that the community tab becomes enabled for, get their channel discussions (name prior to March 2013 “One channel layout” redesign finalization: “channel comments”) permanently erased, instead of co-existing or migrating.", "YouTube offers users the ability to view its videos on web pages outside their website. Each YouTube video is accompanied by a piece of HTML that can be used to embed it on any page on the Web.", "YouTube does not usually offer a download link for its videos, and intends for them to be viewed through its website interface.", "Users retain copyright of their own work under the default Standard YouTube License,", "Most modern smartphones are capable of accessing YouTube videos, either within an application or through an optimized website. YouTube Mobile was launched in June 2007, using RTSP streaming for the video.", "A TiVo service update in July 2008 allowed the system to search and play YouTube videos.", "On June 19, 2007, Google CEO Eric Schmidt traveled to Paris to launch the new localization system.", "The YouTube interface suggests which local version should be chosen on the basis of the IP address of the user. In some cases, the message \"This video is not available in your country\" may appear because of copyright restrictions or inappropriate content.", "YouTube Premium (formerly YouTube Red) is YouTube's premium subscription service. It offers advertising-free streaming, access to exclusive content, background and offline video playback on mobile devices, and access to the Google Play Music \"All Access\" service.", "In May 2014, before Music Key service was launched, the independent music trade organization Worldwide Independent Network alleged that YouTube was using non-negotiable contracts with independent labels that were \"undervalued\" in comparison to other streaming services, and that YouTube would block all music content from labels who do not reach a deal to be included on the paid service. In a statement to the Financial Times in June 2014, Robert Kyncl confirmed that YouTube would block the content of labels who do not negotiate deals to be included in the paid service \"to ensure that all content on the platform is governed by its new contractual terms.\" Stating that 90% of labels had reached deals, he went on to say that \"while we wish that we had [a] 100% success rate, we understand that is not likely an achievable goal and therefore it is our responsibility to our users and the industry to launch the enhanced music experience.\"", "On September 28, 2016, YouTube named Lyor Cohen, the co-founder of 300 Entertainment and former Warner Music Group executive, the Global Head of Music.", "On February 28, 2017, in a press announcement held at YouTube Space Los Angeles, YouTube announced the launch of YouTube TV, an over-the-top MVPD-style subscription service that would be available for United States customers at a price of US$35 per month. Initially launching in five major markets (New York City, Los Angeles, Chicago, Philadelphia and San Francisco) on April 5, 2017,", "During the 2017 World Series (in which it was the presenting sponsor), YouTube TV ads were placed behind the home plate. The trademarked red play button logo appeared at the center of the screen, mimicking YouTube's interface.", "YouTube Go is an Android app aimed at making YouTube easier to access on mobile devices in emerging markets. It is distinct from the company's main Android app and allows videos to be downloaded and shared with other users. It also allows users to preview videos, share downloaded videos through Bluetooth, and offers more options for mobile data control and video resolution.", "YouTube announced the project in September 2016 at an event in India.", "In early 2018, Cohen began hinting at the possible launch of YouTube's new subscription music streaming service, a platform that would compete with other services such as Spotify and Apple Music.", "In 2018, YouTube became an ISNI registry, and announced its intention to begin creating ISNI identifiers to uniquely identify the musicians whose videos it features.", "YouTube featured an April Fools prank on the site on April 1 of every year from 2008 to 2016. In 2008, all links to videos on the main page were redirected to Rick Astley's music video \"Never Gonna Give You Up\", a prank known as \"rickrolling\".", "The next year, the site celebrated its \"100th anniversary\" with a range of sepia-toned silent, early 1900s-style films, including a parody of Keyboard Cat.", "In 2013, YouTube teamed up with satirical newspaper company The Onion to claim in an uploaded video that the video sharing website was launched as a contest which had finally come to an end, and would shut down for ten years before being re-launched in 2023, featuring only the winning video. The video starred several YouTube celebrities, including Antoine Dodson. A video of two presenters announcing the nominated videos streamed live for 12 hours.", "In 2014, YouTube announced that it was responsible for the creation of all viral video trends, and revealed previews of upcoming trends, such as \"Clocking\", \"Kissing Dad\", and \"Glub Glub Water Dance\".", "In 2016, YouTube introduced a global program to develop creators whose videos produce a positive social impact. Google dedicated $1 million to this Creators for Change program.", "Both private individuals", "Observing that face-to-face communication of the type that online videos convey has been \"fine-tuned by millions of years of evolution\", TED curator Chris Anderson referred to several YouTube contributors and asserted that \"what Gutenberg did for writing, online video can now do for face-to-face communication\".", "YouTube has enabled people to more directly engage with government, such as in the CNN/YouTube presidential debates (2007) in which ordinary people submitted questions to U.S. presidential candidates via YouTube video, with a techPresident co-founder saying that Internet video was changing the political landscape.", "Conversely, YouTube has also allowed government to more easily engage with citizens, the White House's official YouTube channel being the seventh top news organization producer on YouTube in 2012", "Some YouTube videos have themselves had a direct effect on world events, such as Innocence of Muslims (2012) which spurred protests and related anti-American violence internationally.", "The Legion of Extraordinary Dancers", "Google does not provide detailed figures for YouTube's running costs, and YouTube's revenues in 2007 were noted as \"not material\" in a regulatory filing.", "YouTube entered into a marketing and advertising partnership with NBC in June 2006.", "In May 2007, YouTube launched its Partner Program (YPP), a system based on AdSense which allows the uploader of the video to share the revenue produced by advertising on the site.", "There are over a million members of the YouTube Partner Program.", "YouTube policies restrict certain forms of content from being included in videos being monetized with advertising, including videos containing strong violence, language, sexual content, \"controversial or sensitive subjects and events, including subjects related to war, political conflicts, natural disasters and tragedies, even if graphic imagery is not shown\" (unless the content is \"usually newsworthy or comedic and the creator's intent is to inform or entertain\"),", "In 2013, YouTube introduced an option for channels with at least a thousand subscribers to require a paid subscription in order for viewers to watch videos.", "YouTube Play Buttons, a part of the YouTube Creator Rewards, are a recognition by YouTube of its most popular channels.", "Much of YouTube's revenue goes to the copyright holders of the videos.", "YouTube has a set of community guidelines aimed to reduce abuse of the site's features. Generally prohibited material includes sexually explicit content, videos of animal abuse, shock videos, content uploaded without the copyright holder's consent, hate speech, spam, and predatory behavior. Despite the guidelines, YouTube has faced criticism from news sources for content in violation of these guidelines.", "At the time of uploading a video, YouTube users are shown a message asking them not to violate copyright laws.", "During the same court battle, Viacom won a court ruling requiring YouTube to hand over 12 terabytes of data detailing the viewing habits of every user who has watched videos on the site. The decision was criticized by the Electronic Frontier Foundation, which called the court ruling \"a setback to privacy rights\".", "In August 2008, a US court ruled in Lenz v. Universal Music Corp. that copyright holders cannot order the removal of an online file without first determining whether the posting reflected fair use of the material. The case involved Stephanie Lenz from Gallitzin, Pennsylvania, who had made a home video of her 13-month-old son dancing to Prince's song \"Let's Go Crazy\", and posted the 29-second video on YouTube.", "In April 2012, a court in Hamburg ruled that YouTube could be held responsible for copyrighted material posted by its users. The performance rights organization GEMA argued that YouTube had not done enough to prevent the uploading of German copyrighted music. YouTube responded by stating:", "On November 1, 2016, the dispute with GEMA was resolved, with Google content ID being used to allow advertisements to be added to videos with content protected by GEMA.", "In April 2013, it was reported that Universal Music Group and YouTube have a contractual agreement that prevents content blocked on YouTube by a request from UMG from being restored, even if the uploader of the video files a DMCA counter-notice. When a dispute occurs, the uploader of the video has to contact UMG.", "In June 2007, YouTube began trials of a system for automatic detection of uploaded videos that infringe copyright. Google CEO Eric Schmidt regarded this system as necessary for resolving lawsuits such as the one from Viacom, which alleged that YouTube profited from content that it did not have the right to distribute.", "An independent test in 2009 uploaded multiple versions of the same song to YouTube, and concluded that while the system was \"surprisingly resilient\" in finding copyright violations in the audio tracks of videos, it was not infallible.", "YouTube has also faced criticism over the handling of offensive content in some of its videos. The uploading of videos containing defamation, pornography, and material encouraging criminal conduct is forbidden by YouTube's \"Community Guidelines\".", "Controversial content has included material relating to Holocaust denial and the Hillsborough disaster, in which 96 football fans from Liverpool were crushed to death in 1989. In July 2008, the Culture and Media Committee of the House of Commons of the United Kingdom stated that it was \"unimpressed\" with YouTube's system for policing its videos, and argued that \"proactive review of content should be standard practice for sites hosting user-generated content\". YouTube responded by stating:", "In October 2010, U.S. Congressman Anthony Weiner urged YouTube to remove from its website videos of imam Anwar al-Awlaki.", "Following media reports about PRISM, NSA's massive electronic surveillance program, in June 2013, several technology companies were identified as participants, including YouTube. According to leaks from the program, YouTube joined the PRISM program in 2010.", "YouTube's policies on \"advertiser-friendly content\" restrict what may be incorporated into videos being monetized; this includes strong violence, language, sexual content, and \"controversial or sensitive subjects and events, including subjects related to war, political conflicts, natural disasters and tragedies, even if graphic imagery is not shown\", unless the content is \"usually newsworthy or comedic and the creator's intent is to inform or entertain\".", "In March 2017, the government of the United Kingdom pulled its advertising campaigns from YouTube, after reports that its ads had appeared on videos containing extremist content. The government demanded assurances that its advertising would \"be delivered in a safe and appropriate way\". The Guardian newspaper, as well as other major British and U.S. brands, similarly suspended their advertising on YouTube in response to their advertising appearing near offensive content. Google stated that it had \"begun an extensive review of our advertising policies and have made a public commitment to put in place changes that give brands more control over where their ads appear\".", "On April 6, 2017, YouTube announced that in order to \"ensure revenue only flows to creators who are playing by the rules\", it would change its practices to require that a channel undergo a policy compliance review, and have at least 10,000 lifetime views, before they may join the Partner Program.", "In January 2018, YouTube creator Logan Paul faced criticism for a video he had uploaded from a trip to Japan, where he encountered a body of a suicide death in the Aokigahara forest. The corpse was visible in the video, although its face was censored. The video proved controversial due to its content, with its handling of the subject matter being deemed insensitive by critics. On January 10—eleven days after the video was published—YouTube announced that it would cut Paul from the Google Preferred advertising program. Six days later, YouTube announced tighter thresholds for the partner program to \"significantly improve our ability to identify creators who contribute positively to the community\", under which channels must have at least 4,000 hours of watch time within the past 12 months and at least 1,000 subscribers. YouTube also announced that videos approved for the Google Preferred program would become subject to manual review, and that videos would be rated based on suitability (with advertisers allowed to choose).", "These changes led to further criticism of YouTube from independent channels, who alleged that the service had been changing its algorithms to give a higher prominence to professionally-produced content (such as celebrities, music videos and clips from late night talk shows), that attract wide viewership and has a lower risk of alienating mainstream advertisers, at the expense of the creators that had bolstered the service's popularity."]}
]